
#
create_supply_net VDD
create_supply_net VSS
create_supply_net VDD1V
create_supply_net VDD1V_MEM
create_supply_port VDD
create_supply_port VSS
create_supply_port VDD1V
create_supply_port VDD1V_MEM
connect_supply_net VDD -port VDD
connect_supply_net VSS -port VSS
connect_supply_net VDD1V -port VDD1V
connect_supply_net VDD1V_MEM -port VDD1V_MEM


create_supply_net VDD1V_PD23
create_power_domain PD23
create_power_switch PD23_sw -domain PD23 \
                           -input_supply_port {VDDG VDD1V} -output_supply_port {VDD VDD1V_PD23}  \
                           -control_port {SCPRE_PD_23 SCPRE_PD_23} \
                           -control_port {SCALL_PD_23 SCALL_PD_23} \
                           -on_state {PD23_on_state_pre VDDG {!SCPRE_PD_23}} \
                           -on_state {PD23_on_state_all VDDG {!SCALL_PD_23}}

map_power_switch PD23_sw -domain PD23 -lib_cells HEADBUF32_X2M_A8TR_C34

set_domain_supply_net PD23  -primary_power_net VDD1V_PD23 -primary_ground_net VSS
connect_supply_net VDD1V_MEM -ports { ASURA_BACD/ASURA_CPUIF_BACD/regif/Mode_Register_BACD_REGIF_MEM0/RB_CDU_A0_MEM_R_39/CDU_A0_MEM_R_39/u0/u0/VDDCE }
connect_supply_net VDD1V_MEM -ports { ASURA_BACD/ASURA_CPUIF_BACD/regif/Mode_Register_BACD_REGIF_MEM1/RB_CDU_A0_MEM_R_40/CDU_A0_MEM_R_40/u0/u0/VDDCE }
connect_supply_net VDD1V_MEM -ports { ASURA_BACD/ASURA_ACDTOP/nghbm1/RB_CDU_A0_MEM_R_38/CDU_A0_MEM_R_38/u0/u0/VDDCE }
connect_supply_net VDD1V_MEM -ports { ASURA_BACD/ASURA_ACDTOP/bsbom1/RB_CDU_A0_MEM_R_35/CDU_A0_MEM_R_35/u0/u0/VDDCE }
connect_supply_net VDD1V_MEM -ports { ASURA_BACD/ASURA_ACDTOP/bsbom0/RB_CDU_A0_MEM_R_34/CDU_A0_MEM_R_34/u0/u0/VDDCE }
connect_supply_net VDD1V_MEM -ports { ASURA_BACD/ASURA_ACDTOP/bsbim1/RB_CDU_A0_MEM_R_33/CDU_A0_MEM_R_33/u0/u0/VDDCE }
connect_supply_net VDD1V_MEM -ports { ASURA_BACD/ASURA_ACDTOP/bsbim0/RB_CDU_A0_MEM_R_32/CDU_A0_MEM_R_32/u0/u0/VDDCE }
connect_supply_net VDD1V_MEM -ports { ASURA_BACD/ASURA_ACDTOP/ssimem1/RB_CDU_A0_MEM_38/CDU_A0_MEM_38/VDDCE }
connect_supply_net VDD1V_MEM -ports { ASURA_BACD/ASURA_ACDTOP/ssimem0/RB_CDU_A0_MEM_37/CDU_A0_MEM_37/VDDCE }
connect_supply_net VDD1V_MEM -ports { ASURA_BACD/ASURA_ACDTOP/hngmvm/RB_CDU_A0_MEM_R_36/CDU_A0_MEM_R_36/u0/u0/VDDCE }
connect_supply_net VDD1V_MEM -ports { ASURA_BACD/ASURA_ACDTOP/h5acd_ctxvmem0/RB_CDU_A0_MEM_36/CDU_A0_MEM_36/VDDCE }
connect_supply_net VDD1V_MEM -ports { ASURA_BACD/ASURA_ACDTOP/h5acd_ctxvmem0/RB_CDU_A0_MEM_35/CDU_A0_MEM_35/VDDCE }
connect_supply_net VDD1V_MEM -ports { ASURA_CORE/ASURA_VCESEQ/IP_MEM/sram_mvmmem/RB_CDU_A0_MEM_R_29/CDU_A0_MEM_R_29/u0/u0/VDDCE }
connect_supply_net VDD1V_MEM -ports { ASURA_CORE/ASURA_VCESEQ/IP_MEM/sram_mvmmem/RB_CDU_A0_MEM_R_3/CDU_A0_MEM_R_3/u0/u0/VDDCE }
connect_supply_net VDD1V_MEM -ports { ASURA_CORE/ASURA_VCESEQ/IP_MEM/sram_mvmmem/RB_CDU_A0_MEM_R_2/CDU_A0_MEM_R_2/u0/u0/VDDCE }
connect_supply_net VDD1V_MEM -ports { ASURA_CORE/ASURA_VCESEQ/TC_MEM/TC_SHARE_MEM/RB_CDU_A0_MEM_R_4/CDU_A0_MEM_R_4/u0/u0/VDDCE }
connect_supply_net VDD1V_MEM -ports { ASURA_CORE/ASURA_VCESEQ/ASURA_MECSEQ/sram_mecostmem/RB_CDU_A0_MEM_R_28/CDU_A0_MEM_R_28/u0/u0/VDDCE }
connect_supply_net VDD1V_MEM -ports { ASURA_BACD/ASURA_ACDTOP/nghbm0/RB_CDU_A0_MEM_R_37/CDU_A0_MEM_R_37/u0/u0/VDDCE }
connect_supply_net VDD1V_MEM -ports { ASURA_CORE/ASURA_VCESEQ/ASURA_MECSEQ/AsurAKw0085_sub_colMvCtrl_mec_sram_mvmmem_out_bank0/RB_CDU_A0_MEM_3/CDU_A0_MEM_3/VDDCE }
connect_supply_net VDD1V_MEM -ports { ASURA_CORE/ASURA_VCESEQ/ASURA_MECSEQ/AsurAKw0085_sub_colMvCtrl_mec_sram_mvmmem_out_bank1/RB_CDU_A0_MEM_4/CDU_A0_MEM_4/VDDCE }
connect_supply_net VDD1V_MEM -ports { ASURA_CORE/ASURA_VCESEQ/ASURA_MECSEQ/AsurAKw0085_sub_colMvCtrl_mec_sram_mvmmem_in_bank0/RB_CDU_A0_MEM_1/CDU_A0_MEM_1/VDDCE }
connect_supply_net VDD1V_MEM -ports { ASURA_CORE/ASURA_VCESEQ/ASURA_MECSEQ/AsurAKw0085_sub_colMvCtrl_mec_sram_mvmmem_in_bank1/RB_CDU_A0_MEM_2/CDU_A0_MEM_2/VDDCE }
connect_supply_net VDD1V_MEM -ports { ASURA_CORE/ASURA_VCESEQ/ASURA_MECSEQ/sram_mvmmem/RB_CDU_A0_MEM_R_1/CDU_A0_MEM_R_1/u0/u0/VDDCE }
connect_supply_net VDD1V_MEM -ports { ASURA_CORE/ASURA_VCETOP/ASURA_PIXDIF/pixdref_sp1b/RB_CDU_A0_MEM_R_49/CDU_A0_MEM_R_49/u0/u0/VDDCE }
connect_supply_net VDD1V_MEM -ports { ASURA_CORE/ASURA_VCETOP/ASURA_PIXDIF/pixdref_sp0b/RB_CDU_A0_MEM_R_48/CDU_A0_MEM_R_48/u0/u0/VDDCE }
connect_supply_net VDD1V_MEM -ports { ASURA_CORE/ASURA_VCETOP/ASURA_PIXDIF/pixdref_sp1a/RB_CDU_A0_MEM_45/CDU_A0_MEM_45/VDDCE }
connect_supply_net VDD1V_MEM -ports { ASURA_CORE/ASURA_VCETOP/ASURA_PIXDIF/pixdref_sp0a/RB_CDU_A0_MEM_44/CDU_A0_MEM_44/VDDCE }
connect_supply_net VDD1V_MEM -ports { ASURA_CORE/ASURA_VCETOP/ASURA_PIXDIF/pixdorg_sp0/RB_CDU_A0_MEM_R_47/CDU_A0_MEM_R_47/u0/u0/VDDCE }
connect_supply_net VDD1V_MEM -ports { ASURA_CORE/ASURA_VCETOP/ASURA_PDQTOP/cntmem_top_RCNMEM0/RB_CDU_A0_MEM_20/CDU_A0_MEM_20/VDDCE }
connect_supply_net VDD1V_MEM -ports { ASURA_CORE/ASURA_VCETOP/ASURA_PDQTOP/cntmem_top_RCNMEM1/RB_CDU_A0_MEM_21/CDU_A0_MEM_21/VDDCE }
connect_supply_net VDD1V_MEM -ports { ASURA_CORE/ASURA_VCETOP/ASURA_PDQTOP/cntmem_top_DCTMEM0/RB_CDU_A0_MEM_16/CDU_A0_MEM_16/VDDCE }
connect_supply_net VDD1V_MEM -ports { ASURA_CORE/ASURA_VCETOP/ASURA_PDQTOP/cntmem_top_DCTMEM1/RB_CDU_A0_MEM_17/CDU_A0_MEM_17/VDDCE }
connect_supply_net VDD1V_MEM -ports { ASURA_CORE/ASURA_VCETOP/ASURA_MECTOP/ME_SUB_REFDICON_MEMEM_REFDICON0/RB_CDU_A0_MEM_R_46/CDU_A0_MEM_R_46/u0/u0/VDDCE }
connect_supply_net VDD1V_MEM -ports { ASURA_CORE/ASURA_VCETOP/ASURA_MECTOP/ME_SUB_REFDICON_MEMEM_REFDICO1/RB_CDU_A0_MEM_R_45/CDU_A0_MEM_R_45/u0/u0/VDDCE }
connect_supply_net VDD1V_MEM -ports { ASURA_CORE/ASURA_VCETOP/ASURA_MECTOP/ASURA_ME_SUB_ORGARBCON_me_sub_orgmem1_ME_SUB_ORGMEM1_03_MEMEM_ORGMEM1_xx/RB_CDU_A0_MEM_R_44/CDU_A0_MEM_R_44/u0/u0/VDDCE }
connect_supply_net VDD1V_MEM -ports { ASURA_CORE/ASURA_VCETOP/ASURA_MECTOP/ASURA_ME_SUB_ORGARBCON_me_sub_orgmem1_ME_SUB_ORGMEM1_02_MEMEM_ORGMEM1_xx/RB_CDU_A0_MEM_R_43/CDU_A0_MEM_R_43/u0/u0/VDDCE }
connect_supply_net VDD1V_MEM -ports { ASURA_CORE/ASURA_VCETOP/ASURA_MECTOP/ASURA_ME_SUB_ORGARBCON_me_sub_orgmem1_ME_SUB_ORGMEM1_01_MEMEM_ORGMEM1_xx/RB_CDU_A0_MEM_R_42/CDU_A0_MEM_R_42/u0/u0/VDDCE }
connect_supply_net VDD1V_MEM -ports { ASURA_CORE/ASURA_VCETOP/ASURA_MECTOP/ASURA_ME_SUB_ORGARBCON_me_sub_orgmem1_ME_SUB_ORGMEM1_00_MEMEM_ORGMEM1_xx/RB_CDU_A0_MEM_R_41/CDU_A0_MEM_R_41/u0/u0/VDDCE }
connect_supply_net VDD1V_MEM -ports { ASURA_CORE/ASURA_VCETOP/ASURA_MECTOP/ASURA_ME_SUB_ORGARBCON_me_sub_orgmem0_ME_SUB_ORGMEM0_04_MEMEM_ORGMEM0_xx/RB_CDU_A0_MEM_43/CDU_A0_MEM_43/VDDCE }
connect_supply_net VDD1V_MEM -ports { ASURA_CORE/ASURA_VCETOP/ASURA_MECTOP/ASURA_ME_SUB_ORGARBCON_me_sub_orgmem0_ME_SUB_ORGMEM0_03_MEMEM_ORGMEM0_xx/RB_CDU_A0_MEM_42/CDU_A0_MEM_42/VDDCE }
connect_supply_net VDD1V_MEM -ports { ASURA_CORE/ASURA_VCETOP/ASURA_MECTOP/ASURA_ME_SUB_ORGARBCON_me_sub_orgmem0_ME_SUB_ORGMEM0_02_MEMEM_ORGMEM0_xx/RB_CDU_A0_MEM_41/CDU_A0_MEM_41/VDDCE }
connect_supply_net VDD1V_MEM -ports { ASURA_CORE/ASURA_VCETOP/ASURA_MECTOP/ASURA_ME_SUB_ORGARBCON_me_sub_orgmem0_ME_SUB_ORGMEM0_01_MEMEM_ORGMEM0_xx/RB_CDU_A0_MEM_40/CDU_A0_MEM_40/VDDCE }
connect_supply_net VDD1V_MEM -ports { ASURA_CORE/ASURA_VCETOP/ASURA_MECTOP/ASURA_ME_SUB_ORGARBCON_me_sub_orgmem0_ME_SUB_ORGMEM0_00_MEMEM_ORGMEM0_xx/RB_CDU_A0_MEM_39/CDU_A0_MEM_39/VDDCE }
connect_supply_net VDD1V_MEM -ports { ASURA_CORE/ASURA_VCETOP/ASURA_PDQTOP/cntmem_top_IPCMMEM0/RB_CDU_A0_MEM_18/CDU_A0_MEM_18/VDDCE }
connect_supply_net VDD1V_MEM -ports { ASURA_CORE/ASURA_VCETOP/ASURA_PDQTOP/cntmem_top_IPCMMEM1/RB_CDU_A0_MEM_19/CDU_A0_MEM_19/VDDCE }
connect_supply_net VDD1V_MEM -ports { ASURA_CORE/ASURA_VCETOP/ASURA_VLCDTOP/ASURA_AsurAKw0035_ZEPHYR_VLCTOP_CAPBM/RB_CDU_A0_MEM_22/CDU_A0_MEM_22/VDDCE }
connect_supply_net VDD1V_MEM -ports { ASURA_CORE/ASURA_VCETOP/ASURA_VLCDTOP/SUBSMEM1/RB_CDU_A0_MEM_32/CDU_A0_MEM_32/VDDCE }
connect_supply_net VDD1V_MEM -ports { ASURA_CORE/ASURA_VCETOP/ASURA_VLCDTOP/SUBSMEM0/RB_CDU_A0_MEM_31/CDU_A0_MEM_31/VDDCE }
connect_supply_net VDD1V_MEM -ports { ASURA_CORE/ASURA_VCETOP/ASURA_VLCDTOP/VLCDMEM1/RB_CDU_A0_MEM_34/CDU_A0_MEM_34/VDDCE }
connect_supply_net VDD1V_MEM -ports { ASURA_CORE/ASURA_VCETOP/ASURA_VLCDTOP/VLCDMEM0/RB_CDU_A0_MEM_33/CDU_A0_MEM_33/VDDCE }
connect_supply_net VDD1V_MEM -ports { ASURA_CORE/ASURA_VCETOP/ASURA_VLCDTOP/BANK3MEMB/RB_CDU_A0_MEM_30/CDU_A0_MEM_30/VDDCE }
connect_supply_net VDD1V_MEM -ports { ASURA_CORE/ASURA_VCETOP/ASURA_VLCDTOP/BANK2MEMB/RB_CDU_A0_MEM_28/CDU_A0_MEM_28/VDDCE }
connect_supply_net VDD1V_MEM -ports { ASURA_CORE/ASURA_VCETOP/ASURA_VLCDTOP/BANK1MEMB/RB_CDU_A0_MEM_26/CDU_A0_MEM_26/VDDCE }
connect_supply_net VDD1V_MEM -ports { ASURA_CORE/ASURA_VCETOP/ASURA_VLCDTOP/BANK0MEMB/RB_CDU_A0_MEM_24/CDU_A0_MEM_24/VDDCE }
connect_supply_net VDD1V_MEM -ports { ASURA_CORE/ASURA_VCETOP/ASURA_VLCDTOP/BANK3MEMA/RB_CDU_A0_MEM_29/CDU_A0_MEM_29/VDDCE }
connect_supply_net VDD1V_MEM -ports { ASURA_CORE/ASURA_VCETOP/ASURA_VLCDTOP/BANK2MEMA/RB_CDU_A0_MEM_27/CDU_A0_MEM_27/VDDCE }
connect_supply_net VDD1V_MEM -ports { ASURA_CORE/ASURA_VCETOP/ASURA_VLCDTOP/BANK1MEMA/RB_CDU_A0_MEM_25/CDU_A0_MEM_25/VDDCE }
connect_supply_net VDD1V_MEM -ports { ASURA_CORE/ASURA_VCETOP/ASURA_VLCDTOP/BANK0MEMA/RB_CDU_A0_MEM_23/CDU_A0_MEM_23/VDDCE }
connect_supply_net VDD1V_MEM -ports { ASURA_CORE/ASURA_VCETOP/dcoefmem/DCOEF_FIFO_MEM/RB_CDU_A0_MEM_R_31/CDU_A0_MEM_R_31/u0/u0/VDDCE }
connect_supply_net VDD1V_MEM -ports { ASURA_CORE/ASURA_VCETOP/dcoefmem/DCOEF_FIFO_MEM/RB_CDU_A0_MEM_R_30/CDU_A0_MEM_R_30/u0/u0/VDDCE }
connect_supply_net VDD1V_MEM -ports { ASURA_CORE/ASURA_DMIFTOP_CORE/DMIF_COL5IN/RB_CDU_A0_MEM_R_24/CDU_A0_MEM_R_24/u0/u0/VDDCE }
connect_supply_net VDD1V_MEM -ports { ASURA_CORE/ASURA_DMIFTOP_CORE/DMIF_COL5OUT/RB_CDU_A0_MEM_R_25/CDU_A0_MEM_R_25/u0/u0/VDDCE }
connect_supply_net VDD1V_MEM -ports { ASURA_CORE/ASURA_DMIFTOP_CORE/sub_dmifmem_core_substr/DMIF_STRBUF/RB_CDU_A0_MEM_R_27/CDU_A0_MEM_R_27/u0/u0/VDDCE }
connect_supply_net VDD1V_MEM -ports { ASURA_CORE/ASURA_DMIFTOP_CORE/sub_dmifmem_core/DMIF_STRBUF/RB_CDU_A0_MEM_R_26/CDU_A0_MEM_R_26/u0/u0/VDDCE }
connect_supply_net VDD1V_MEM -ports { ASURA_CORE/ASURA_VCETOP/ASURA_DBFTOP/ADBFCMEM3/RB_CDU_A0_MEM_8/CDU_A0_MEM_8/VDDCE }
connect_supply_net VDD1V_MEM -ports { ASURA_CORE/ASURA_VCETOP/ASURA_DBFTOP/ADBFCMEM2/RB_CDU_A0_MEM_7/CDU_A0_MEM_7/VDDCE }
connect_supply_net VDD1V_MEM -ports { ASURA_CORE/ASURA_VCETOP/ASURA_DBFTOP/ADBFCMEM1/RB_CDU_A0_MEM_6/CDU_A0_MEM_6/VDDCE }
connect_supply_net VDD1V_MEM -ports { ASURA_CORE/ASURA_VCETOP/ASURA_DBFTOP/ADBFCMEM0/RB_CDU_A0_MEM_5/CDU_A0_MEM_5/VDDCE }
connect_supply_net VDD1V_MEM -ports { ASURA_CORE/ASURA_VCETOP/ASURA_DBFTOP/ADBFLMEM3/RB_CDU_A0_MEM_12/CDU_A0_MEM_12/VDDCE }
connect_supply_net VDD1V_MEM -ports { ASURA_CORE/ASURA_VCETOP/ASURA_DBFTOP/ADBFLMEM2/RB_CDU_A0_MEM_11/CDU_A0_MEM_11/VDDCE }
connect_supply_net VDD1V_MEM -ports { ASURA_CORE/ASURA_VCETOP/ASURA_DBFTOP/ADBFLMEM1/RB_CDU_A0_MEM_10/CDU_A0_MEM_10/VDDCE }
connect_supply_net VDD1V_MEM -ports { ASURA_CORE/ASURA_VCETOP/ASURA_DBFTOP/ADBFLMEM0/RB_CDU_A0_MEM_9/CDU_A0_MEM_9/VDDCE }
connect_supply_net VDD1V_MEM -ports { ASURA_CORE/ASURA_VCETOP/ASURA_DBFTOP/ANBLLM1/RB_CDU_A0_MEM_14/CDU_A0_MEM_14/VDDCE }
connect_supply_net VDD1V_MEM -ports { ASURA_CORE/ASURA_VCETOP/ASURA_DBFTOP/ANBLLM0/RB_CDU_A0_MEM_13/CDU_A0_MEM_13/VDDCE }
connect_supply_net VDD1V_MEM -ports { ASURA_CORE/ASURA_VCETOP/ASURA_DBFTOP/ANBULMEM1/RB_CDU_A0_MEM_R_16/CDU_A0_MEM_R_16/u0/u0/VDDCE }
connect_supply_net VDD1V_MEM -ports { ASURA_CORE/ASURA_VCETOP/ASURA_DBFTOP/ANBULMEM1/RB_CDU_A0_MEM_R_15/CDU_A0_MEM_R_15/u0/u0/VDDCE }
connect_supply_net VDD1V_MEM -ports { ASURA_CORE/ASURA_VCETOP/ASURA_DBFTOP/ANBULMEM0/RB_CDU_A0_MEM_R_14/CDU_A0_MEM_R_14/u0/u0/VDDCE }
connect_supply_net VDD1V_MEM -ports { ASURA_CORE/ASURA_VCETOP/ASURA_DBFTOP/ANBULMEM0/RB_CDU_A0_MEM_R_13/CDU_A0_MEM_R_13/u0/u0/VDDCE }
connect_supply_net VDD1V_MEM -ports { ASURA_CORE/ASURA_VCETOP/ASURA_DBFTOP/ANBULMEM0/RB_CDU_A0_MEM_R_12/CDU_A0_MEM_R_12/u0/u0/VDDCE }
connect_supply_net VDD1V_MEM -ports { ASURA_CORE/ASURA_VCETOP/ASURA_DBFTOP/ANBULMEM0/RB_CDU_A0_MEM_R_11/CDU_A0_MEM_R_11/u0/u0/VDDCE }
connect_supply_net VDD1V_MEM -ports { ASURA_CORE/ASURA_VCETOP/ASURA_DBFTOP/ANBULMEM0/RB_CDU_A0_MEM_R_10/CDU_A0_MEM_R_10/u0/u0/VDDCE }
connect_supply_net VDD1V_MEM -ports { ASURA_CORE/ASURA_VCETOP/ASURA_DBFTOP/ANBUCMEM0/RB_CDU_A0_MEM_R_9/CDU_A0_MEM_R_9/u0/u0/VDDCE }
connect_supply_net VDD1V_MEM -ports { ASURA_CORE/ASURA_VCETOP/ASURA_DBFTOP/ANBUCMEM0/RB_CDU_A0_MEM_R_8/CDU_A0_MEM_R_8/u0/u0/VDDCE }
connect_supply_net VDD1V_MEM -ports { ASURA_CORE/ASURA_VCETOP/ASURA_DBFTOP/ANBUCMEM0/RB_CDU_A0_MEM_R_7/CDU_A0_MEM_R_7/u0/u0/VDDCE }
connect_supply_net VDD1V_MEM -ports { ASURA_CORE/ASURA_VCETOP/ASURA_DBFTOP/ANBUCMEM0/RB_CDU_A0_MEM_R_6/CDU_A0_MEM_R_6/u0/u0/VDDCE }
connect_supply_net VDD1V_MEM -ports { ASURA_CORE/ASURA_VCETOP/ASURA_DBFTOP/ANBUCMEM0/RB_CDU_A0_MEM_R_5/CDU_A0_MEM_R_5/u0/u0/VDDCE }
connect_supply_net VDD1V_MEM -ports { ASURA_CORE/ASURA_VCETOP/ASURA_DBFTOP/ANBULMEM1/RB_CDU_A0_MEM_R_19/CDU_A0_MEM_R_19/u0/u0/VDDCE }
connect_supply_net VDD1V_MEM -ports { ASURA_CORE/ASURA_VCETOP/ASURA_DBFTOP/ANBULMEM1/RB_CDU_A0_MEM_R_18/CDU_A0_MEM_R_18/u0/u0/VDDCE }
connect_supply_net VDD1V_MEM -ports { ASURA_CORE/ASURA_VCETOP/ASURA_DBFTOP/ANBULMEM1/RB_CDU_A0_MEM_R_17/CDU_A0_MEM_R_17/u0/u0/VDDCE }
connect_supply_net VDD1V_MEM -ports { ASURA_CORE/ASURA_CPUIF_CORE/rttop/ASURA_RTCREG_RTCMEM/RB_CDU_A0_MEM_15/CDU_A0_MEM_15/VDDCE }
connect_supply_net VDD1V_MEM -ports { ASURA_CORE/ASURA_CPUIF_CORE/regif/Qmtx_Register_CORE_REGIF_QMTX_MEM_CORE0_REGIF_QMTXMEM/RB_CDU_A0_MEM_R_22/CDU_A0_MEM_R_22/u0/u0/VDDCE }
connect_supply_net VDD1V_MEM -ports { ASURA_CORE/ASURA_CPUIF_CORE/regif/Qmtx_Register_CORE_REGIF_QMTX_MEM_CORE1_REGIF_QMTXMEM/RB_CDU_A0_MEM_R_23/CDU_A0_MEM_R_23/u0/u0/VDDCE }
connect_supply_net VDD1V_MEM -ports { ASURA_CORE/ASURA_CPUIF_CORE/regif/Mode_Register_CORE_REGIF_MEM0/RB_CDU_A0_MEM_R_20/CDU_A0_MEM_R_20/u0/u0/VDDCE }
connect_supply_net VDD1V_MEM -ports { ASURA_CORE/ASURA_CPUIF_CORE/regif/Mode_Register_CORE_REGIF_MEM1/RB_CDU_A0_MEM_R_21/CDU_A0_MEM_R_21/u0/u0/VDDCE }
connect_supply_net VDD1V_MEM -ports { JPM/JPCP/JPCP_SRAM_REF1/RB_CDU_A0_MEM_R_63/CDU_A0_MEM_R_63/u0/u0/VDDCE }
connect_supply_net VDD1V_MEM -ports { JPM/JPCP/JPCP_SRAM_REF0/RB_CDU_A0_MEM_R_62/CDU_A0_MEM_R_62/u0/u0/VDDCE }
connect_supply_net VDD1V_MEM -ports { JPM/JPCP/JPCP_SRAM_RCN0/RB_CDU_A0_MEM_R_61/CDU_A0_MEM_R_61/u0/u0/VDDCE }
connect_supply_net VDD1V_MEM -ports { JPM/JPCP/JPCP_SRAM_R1/RB_CDU_A0_MEM_R_60/CDU_A0_MEM_R_60/u0/u0/VDDCE }
connect_supply_net VDD1V_MEM -ports { JPM/JPCP/JPCP_SRAM_R0/RB_CDU_A0_MEM_R_59/CDU_A0_MEM_R_59/u0/u0/VDDCE }
connect_supply_net VDD1V_MEM -ports { JPM/JPCP/JPCP_SRAM_W/RB_CDU_A0_MEM_R_64/CDU_A0_MEM_R_64/u0/u0/VDDCE }
connect_supply_net VDD1V_MEM -ports { JPM/JPYC/YC_DRAM_BUF7/RB_CDU_A0_MEM_R_78/CDU_A0_MEM_R_78/u0/u0/VDDCE }
connect_supply_net VDD1V_MEM -ports { JPM/JPYC/YC_DRAM_BUF6/RB_CDU_A0_MEM_R_77/CDU_A0_MEM_R_77/u0/u0/VDDCE }
connect_supply_net VDD1V_MEM -ports { JPM/JPYC/YC_DRAM_BUF5/RB_CDU_A0_MEM_R_76/CDU_A0_MEM_R_76/u0/u0/VDDCE }
connect_supply_net VDD1V_MEM -ports { JPM/JPYC/YC_DRAM_BUF4/RB_CDU_A0_MEM_R_75/CDU_A0_MEM_R_75/u0/u0/VDDCE }
connect_supply_net VDD1V_MEM -ports { JPM/JPYC/YC_DRAM_BUF3/RB_CDU_A0_MEM_R_74/CDU_A0_MEM_R_74/u0/u0/VDDCE }
connect_supply_net VDD1V_MEM -ports { JPM/JPYC/YC_DRAM_BUF2/RB_CDU_A0_MEM_R_73/CDU_A0_MEM_R_73/u0/u0/VDDCE }
connect_supply_net VDD1V_MEM -ports { JPM/JPYC/YC_DRAM_BUF1/RB_CDU_A0_MEM_R_72/CDU_A0_MEM_R_72/u0/u0/VDDCE }
connect_supply_net VDD1V_MEM -ports { JPM/JPYC/YC_DRAM_BUF0/RB_CDU_A0_MEM_R_71/CDU_A0_MEM_R_71/u0/u0/VDDCE }
connect_supply_net VDD1V_MEM -ports { JPM/JPYC/CDU_BITDEC/BDOUT/RB_CDU_A0_MEM_47/CDU_A0_MEM_47/VDDCE }
connect_supply_net VDD1V_MEM -ports { JPM/JPYC/CDU_BITDEC/BDIN/RB_CDU_A0_MEM_46/CDU_A0_MEM_46/VDDCE }
connect_supply_net VDD1V_MEM -ports { JPM/JPYC/CDUSR1/RB_CDU_A0_MEM_R_70/CDU_A0_MEM_R_70/u0/u0/VDDCE }
connect_supply_net VDD1V_MEM -ports { JPM/JPYC/CDUSR1/RB_CDU_A0_MEM_R_69/CDU_A0_MEM_R_69/u0/u0/VDDCE }
connect_supply_net VDD1V_MEM -ports { JPM/JPYC/CDUSR0/RB_CDU_A0_MEM_R_68/CDU_A0_MEM_R_68/u0/u0/VDDCE }
connect_supply_net VDD1V_MEM -ports { JPM/JPYC/CDUSR0/RB_CDU_A0_MEM_R_67/CDU_A0_MEM_R_67/u0/u0/VDDCE }
connect_supply_net VDD1V_MEM -ports { JPM/JPYC/CDUSR0/RB_CDU_A0_MEM_R_66/CDU_A0_MEM_R_66/u0/u0/VDDCE }
connect_supply_net VDD1V_MEM -ports { JPM/JPYC/CDUSR0/RB_CDU_A0_MEM_R_65/CDU_A0_MEM_R_65/u0/u0/VDDCE }
connect_supply_net VDD1V_MEM -ports { JPM/BACDM/BACD_SRAM_RSTR/RB_CDU_A0_MEM_R_52/CDU_A0_MEM_R_52/u0/u0/VDDCE }
connect_supply_net VDD1V_MEM -ports { JPM/BACDM/BACD_SRAM_WSTR/RB_CDU_A0_MEM_R_53/CDU_A0_MEM_R_53/u0/u0/VDDCE }
connect_supply_net VDD1V_MEM -ports { JPM/BACDM/BACD_SRAM_CO1/RB_CDU_A0_MEM_R_51/CDU_A0_MEM_R_51/u0/u0/VDDCE }
connect_supply_net VDD1V_MEM -ports { JPM/BACDM/BACD_SRAM_CO0/RB_CDU_A0_MEM_R_50/CDU_A0_MEM_R_50/u0/u0/VDDCE }
connect_supply_net VDD1V_MEM -ports { JPM/JPCP/JPCP_SRAM_CO1/RB_CDU_A0_MEM_R_57/CDU_A0_MEM_R_57/u0/u0/VDDCE }
connect_supply_net VDD1V_MEM -ports { JPM/JPCP/JPCP_SRAM_CO0/RB_CDU_A0_MEM_R_56/CDU_A0_MEM_R_56/u0/u0/VDDCE }
connect_supply_net VDD1V_MEM -ports { JPM/JPCP/JPCP_SRAM_MV/RB_CDU_A0_MEM_R_58/CDU_A0_MEM_R_58/u0/u0/VDDCE }
connect_supply_net VDD1V_MEM -ports { JPM/JPYC/CDU_PREFILTER/ONIKISSTOP_CDU_ONIBUFEXT_YBANK0/RB_CDU_A0_MEM_57/CDU_A0_MEM_57/VDDCE }
connect_supply_net VDD1V_MEM -ports { JPM/JPYC/CDU_PREFILTER/ONIKISSTOP_CDU_ONIBUFEXT_YBANK0/RB_CDU_A0_MEM_56/CDU_A0_MEM_56/VDDCE }
connect_supply_net VDD1V_MEM -ports { JPM/JPYC/CDU_PREFILTER/ONIKISSTOP_CDU_ONIBUFEXT_YBANK1/RB_CDU_A0_MEM_59/CDU_A0_MEM_59/VDDCE }
connect_supply_net VDD1V_MEM -ports { JPM/JPYC/CDU_PREFILTER/ONIKISSTOP_CDU_ONIBUFEXT_YBANK1/RB_CDU_A0_MEM_58/CDU_A0_MEM_58/VDDCE }
connect_supply_net VDD1V_MEM -ports { JPM/JPYC/CDU_PREFILTER/ONIKISSTOP_CDU_ONIBUFEXT_YBANK2/RB_CDU_A0_MEM_61/CDU_A0_MEM_61/VDDCE }
connect_supply_net VDD1V_MEM -ports { JPM/JPYC/CDU_PREFILTER/ONIKISSTOP_CDU_ONIBUFEXT_YBANK2/RB_CDU_A0_MEM_60/CDU_A0_MEM_60/VDDCE }
connect_supply_net VDD1V_MEM -ports { JPM/JPYC/CDU_PREFILTER/ONIKISSTOP_CDU_ONIBUFEXT_YBANK3/RB_CDU_A0_MEM_63/CDU_A0_MEM_63/VDDCE }
connect_supply_net VDD1V_MEM -ports { JPM/JPYC/CDU_PREFILTER/ONIKISSTOP_CDU_ONIBUFEXT_YBANK3/RB_CDU_A0_MEM_62/CDU_A0_MEM_62/VDDCE }
connect_supply_net VDD1V_MEM -ports { JPM/JPYC/CDU_PREFILTER/ONIKISSTOP_CDU_ONIBUFEXT_CBANK0/RB_CDU_A0_MEM_49/CDU_A0_MEM_49/VDDCE }
connect_supply_net VDD1V_MEM -ports { JPM/JPYC/CDU_PREFILTER/ONIKISSTOP_CDU_ONIBUFEXT_CBANK0/RB_CDU_A0_MEM_48/CDU_A0_MEM_48/VDDCE }
connect_supply_net VDD1V_MEM -ports { JPM/JPYC/CDU_PREFILTER/ONIKISSTOP_CDU_ONIBUFEXT_CBANK1/RB_CDU_A0_MEM_51/CDU_A0_MEM_51/VDDCE }
connect_supply_net VDD1V_MEM -ports { JPM/JPYC/CDU_PREFILTER/ONIKISSTOP_CDU_ONIBUFEXT_CBANK1/RB_CDU_A0_MEM_50/CDU_A0_MEM_50/VDDCE }
connect_supply_net VDD1V_MEM -ports { JPM/JPYC/CDU_PREFILTER/ONIKISSTOP_CDU_ONIBUFEXT_CBANK2/RB_CDU_A0_MEM_53/CDU_A0_MEM_53/VDDCE }
connect_supply_net VDD1V_MEM -ports { JPM/JPYC/CDU_PREFILTER/ONIKISSTOP_CDU_ONIBUFEXT_CBANK2/RB_CDU_A0_MEM_52/CDU_A0_MEM_52/VDDCE }
connect_supply_net VDD1V_MEM -ports { JPM/JPYC/CDU_PREFILTER/ONIKISSTOP_CDU_ONIBUFEXT_CBANK3/RB_CDU_A0_MEM_55/CDU_A0_MEM_55/VDDCE }
connect_supply_net VDD1V_MEM -ports { JPM/JPYC/CDU_PREFILTER/ONIKISSTOP_CDU_ONIBUFEXT_CBANK3/RB_CDU_A0_MEM_54/CDU_A0_MEM_54/VDDCE }
connect_supply_net VDD1V_MEM -ports { JPM/BACDM/FIFO_R/RB_CDU_A0_MEM_R_54/CDU_A0_MEM_R_54/u0/u0/VDDCE }
connect_supply_net VDD1V_MEM -ports { JPM/BACDM/FIFO_W/RB_CDU_A0_MEM_R_55/CDU_A0_MEM_R_55/u0/u0/VDDCE }

