create_supply_net VDD
create_supply_net VSS
create_supply_net VDD1V
create_supply_net VDD1V_MEM
create_supply_port VDD
create_supply_port VSS
create_supply_port VDD1V
create_supply_port VDD1V_MEM
connect_supply_net VDD -port VDD
connect_supply_net VSS -port VSS
connect_supply_net VDD1V -port VDD1V
connect_supply_net VDD1V_MEM -port VDD1V_MEM


create_supply_net VDD_PD24

create_power_domain PD24
create_power_switch PD24_sw -domain PD24 \
                           -input_supply_port {VDDG VDD} -output_supply_port {VDD VDD_PD24}  \
                           -control_port {SCPRE_PD_24 SCPRE_PD_24} \
                           -control_port {SCALL_PD_24 SCALL_PD_24} \
                           -on_state {PD24_on_state_pre VDDG {!SCPRE_PD_24}} \
                           -on_state {PD24_on_state_all VDDG {!SCALL_PD_24}}

map_power_switch PD24_sw -domain PD24 -lib_cells HEADBUF32_X2M_A8TR_C34

set_domain_supply_net PD24  -primary_power_net VDD_PD24 -primary_ground_net VSS


connect_supply_net VDD1V_MEM -ports { ahbMatrix/uahb_mpu16_mc_mpumem_gen_dp2048x16_gen_MEM0/VDDCE }
connect_supply_net VDD1V_MEM -ports { ahbMatrix/uahb_mpu16_mc_mpumem_gen_dp2048x16_gen_MEM1/VDDCE }
connect_supply_net VDD1V_MEM -ports { uahb_ram/uspbs1024x32_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uodmc/Uodm_core_Uodm_axi_slave/Uaxi_slave_rch1_Uaxi_slave_dfifo_r_genblk2_Ufp64x166_MEM0/VDDCE }
connect_supply_net VDD1V_MEM -ports { uodmc/Uodm_core_Uodm_axi_slave/Uaxi_slave_rch1_Uaxi_slave_dfifo_r_genblk2_Ufp64x166_MEM1/VDDCE }
connect_supply_net VDD1V_MEM -ports { uodmc/Uodm_core_Uodm_axi_slave/Uaxi_slave_wch0_Uaxi_slave_dfifo_w_genblk2_Ufp64x184_MEM0/VDDCE }
connect_supply_net VDD1V_MEM -ports { uodmc/Uodm_core_Uodm_axi_slave/Uaxi_slave_wch0_Uaxi_slave_dfifo_w_genblk2_Ufp64x184_MEM1/VDDCE }
connect_supply_net VDD1V_MEM -ports { uodmc/Uodm_core_Uodm_ram_ary/Uspbs9216x128e_MEM01/VDDCE }
connect_supply_net VDD1V_MEM -ports { uodmc/Uodm_core_Uodm_ram_ary/Uspbs9216x128e_MEM02/VDDCE }
connect_supply_net VDD1V_MEM -ports { uodmc/Uodm_core_Uodm_ram_ary/Uspbs9216x128e_MEM03/VDDCE }
connect_supply_net VDD1V_MEM -ports { uodmc/Uodm_core_Uodm_ram_ary/Uspbs9216x128e_MEM04/VDDCE }
connect_supply_net VDD1V_MEM -ports { uodmc/Uodm_core_Uodm_ram_ary/Uspbs9216x128e_MEM11/VDDCE }
connect_supply_net VDD1V_MEM -ports { uodmc/Uodm_core_Uodm_ram_ary/Uspbs9216x128e_MEM12/VDDCE }
connect_supply_net VDD1V_MEM -ports { uodmc/Uodm_core_Uodm_ram_ary/Uspbs9216x128e_MEM13/VDDCE }
connect_supply_net VDD1V_MEM -ports { uodmc/Uodm_core_Uodm_ram_ary/Uspbs9216x128e_MEM14/VDDCE }
connect_supply_net VDD1V_MEM -ports { uodmc/Uodm_core_Uodm_ram_ary/Uspbs9216x128e_MEM21/VDDCE }
connect_supply_net VDD1V_MEM -ports { uodmc/Uodm_core_Uodm_ram_ary/Uspbs9216x128e_MEM22/VDDCE }
connect_supply_net VDD1V_MEM -ports { uodmc/Uodm_core_Uodm_ram_ary/Uspbs9216x128e_MEM23/VDDCE }
connect_supply_net VDD1V_MEM -ports { uodmc/Uodm_core_Uodm_ram_ary/Uspbs9216x128e_MEM24/VDDCE }
connect_supply_net VDD1V_MEM -ports { uodmc/Uodm_core_Uodm_ram_ary/Uspbs9216x128e_MEM31/VDDCE }
connect_supply_net VDD1V_MEM -ports { uodmc/Uodm_core_Uodm_ram_ary/Uspbs9216x128e_MEM32/VDDCE }
connect_supply_net VDD1V_MEM -ports { uodmc/Uodm_core_Uodm_ram_ary/Uspbs9216x128e_MEM33/VDDCE }
connect_supply_net VDD1V_MEM -ports { uodmc/Uodm_core_Uodm_ram_ary/Uspbs9216x128e_MEM34/VDDCE }
connect_supply_net VDD1V_MEM -ports { uodmc/Uodm_core_Uodm_ram_ary/Uspbs9216x128e_MEM41/VDDCE }
connect_supply_net VDD1V_MEM -ports { uodmc/Uodm_core_Uodm_ram_ary/Uspbs9216x128e_MEM42/VDDCE }
connect_supply_net VDD1V_MEM -ports { uodmc/Uodm_core_Uodm_ram_ary/Uspbs9216x128e_MEM43/VDDCE }
connect_supply_net VDD1V_MEM -ports { uodmc/Uodm_core_Uodm_ram_ary/Uspbs9216x128e_MEM44/VDDCE }
connect_supply_net VDD1V_MEM -ports { uodmc/Uodm_core_Uodm_ram_ary/Uspbs9216x128e_MEM51/VDDCE }
connect_supply_net VDD1V_MEM -ports { uodmc/Uodm_core_Uodm_ram_ary/Uspbs9216x128e_MEM52/VDDCE }
connect_supply_net VDD1V_MEM -ports { uodmc/Uodm_core_Uodm_ram_ary/Uspbs9216x128e_MEM53/VDDCE }
connect_supply_net VDD1V_MEM -ports { uodmc/Uodm_core_Uodm_ram_ary/Uspbs9216x128e_MEM54/VDDCE }
connect_supply_net VDD1V_MEM -ports { uodmc/Uodm_core_Uodm_ram_ary/Uspbs9216x128o_MEM01/VDDCE }
connect_supply_net VDD1V_MEM -ports { uodmc/Uodm_core_Uodm_ram_ary/Uspbs9216x128o_MEM02/VDDCE }
connect_supply_net VDD1V_MEM -ports { uodmc/Uodm_core_Uodm_ram_ary/Uspbs9216x128o_MEM03/VDDCE }
connect_supply_net VDD1V_MEM -ports { uodmc/Uodm_core_Uodm_ram_ary/Uspbs9216x128o_MEM04/VDDCE }
connect_supply_net VDD1V_MEM -ports { uodmc/Uodm_core_Uodm_ram_ary/Uspbs9216x128o_MEM11/VDDCE }
connect_supply_net VDD1V_MEM -ports { uodmc/Uodm_core_Uodm_ram_ary/Uspbs9216x128o_MEM12/VDDCE }
connect_supply_net VDD1V_MEM -ports { uodmc/Uodm_core_Uodm_ram_ary/Uspbs9216x128o_MEM13/VDDCE }
connect_supply_net VDD1V_MEM -ports { uodmc/Uodm_core_Uodm_ram_ary/Uspbs9216x128o_MEM14/VDDCE }
connect_supply_net VDD1V_MEM -ports { uodmc/Uodm_core_Uodm_ram_ary/Uspbs9216x128o_MEM21/VDDCE }
connect_supply_net VDD1V_MEM -ports { uodmc/Uodm_core_Uodm_ram_ary/Uspbs9216x128o_MEM22/VDDCE }
connect_supply_net VDD1V_MEM -ports { uodmc/Uodm_core_Uodm_ram_ary/Uspbs9216x128o_MEM23/VDDCE }
connect_supply_net VDD1V_MEM -ports { uodmc/Uodm_core_Uodm_ram_ary/Uspbs9216x128o_MEM24/VDDCE }
connect_supply_net VDD1V_MEM -ports { uodmc/Uodm_core_Uodm_ram_ary/Uspbs9216x128o_MEM31/VDDCE }
connect_supply_net VDD1V_MEM -ports { uodmc/Uodm_core_Uodm_ram_ary/Uspbs9216x128o_MEM32/VDDCE }
connect_supply_net VDD1V_MEM -ports { uodmc/Uodm_core_Uodm_ram_ary/Uspbs9216x128o_MEM33/VDDCE }
connect_supply_net VDD1V_MEM -ports { uodmc/Uodm_core_Uodm_ram_ary/Uspbs9216x128o_MEM34/VDDCE }
connect_supply_net VDD1V_MEM -ports { uodmc/Uodm_core_Uodm_ram_ary/Uspbs9216x128o_MEM41/VDDCE }
connect_supply_net VDD1V_MEM -ports { uodmc/Uodm_core_Uodm_ram_ary/Uspbs9216x128o_MEM42/VDDCE }
connect_supply_net VDD1V_MEM -ports { uodmc/Uodm_core_Uodm_ram_ary/Uspbs9216x128o_MEM43/VDDCE }
connect_supply_net VDD1V_MEM -ports { uodmc/Uodm_core_Uodm_ram_ary/Uspbs9216x128o_MEM44/VDDCE }
connect_supply_net VDD1V_MEM -ports { uodmc/Uodm_core_Uodm_ram_ary/Uspbs9216x128o_MEM51/VDDCE }
connect_supply_net VDD1V_MEM -ports { uodmc/Uodm_core_Uodm_ram_ary/Uspbs9216x128o_MEM52/VDDCE }
connect_supply_net VDD1V_MEM -ports { uodmc/Uodm_core_Uodm_ram_ary/Uspbs9216x128o_MEM53/VDDCE }
connect_supply_net VDD1V_MEM -ports { uodmc/Uodm_core_Uodm_ram_ary/Uspbs9216x128o_MEM54/VDDCE }
connect_supply_net VDD1V_MEM -ports { uodmc/Uodm_core_Uodm_ram_ary/Uspbs9216x32e_MEM0/VDDCE }
connect_supply_net VDD1V_MEM -ports { uodmc/Uodm_core_Uodm_ram_ary/Uspbs9216x32e_MEM1/VDDCE }
connect_supply_net VDD1V_MEM -ports { uodmc/Uodm_core_Uodm_ram_ary/Uspbs9216x32e_MEM2/VDDCE }
connect_supply_net VDD1V_MEM -ports { uodmc/Uodm_core_Uodm_ram_ary/Uspbs9216x32e_MEM3/VDDCE }
connect_supply_net VDD1V_MEM -ports { uodmc/Uodm_core_Uodm_ram_ary/Uspbs9216x32e_MEM4/VDDCE }
connect_supply_net VDD1V_MEM -ports { uodmc/Uodm_core_Uodm_ram_ary/Uspbs9216x32e_MEM5/VDDCE }
connect_supply_net VDD1V_MEM -ports { uodmc/Uodm_core_Uodm_ram_ary/Uspbs9216x32o_MEM0/VDDCE }
connect_supply_net VDD1V_MEM -ports { uodmc/Uodm_core_Uodm_ram_ary/Uspbs9216x32o_MEM1/VDDCE }
connect_supply_net VDD1V_MEM -ports { uodmc/Uodm_core_Uodm_ram_ary/Uspbs9216x32o_MEM2/VDDCE }
connect_supply_net VDD1V_MEM -ports { uodmc/Uodm_core_Uodm_ram_ary/Uspbs9216x32o_MEM3/VDDCE }
connect_supply_net VDD1V_MEM -ports { uodmc/Uodm_core_Uodm_ram_ary/Uspbs9216x32o_MEM4/VDDCE }
connect_supply_net VDD1V_MEM -ports { uodmc/Uodm_core_Uodm_ram_ary/Uspbs9216x32o_MEM5/VDDCE }
connect_supply_net VDD1V_MEM -ports { uodmy/Uodm_core_Uodm_axi_slave/GenReadCh0_Uaxi_slave_rch0_Uaxi_slave_dfifo_r_genblk2_Ufp64x166_MEM0/VDDCE }
connect_supply_net VDD1V_MEM -ports { uodmy/Uodm_core_Uodm_axi_slave/GenReadCh0_Uaxi_slave_rch0_Uaxi_slave_dfifo_r_genblk2_Ufp64x166_MEM1/VDDCE }
connect_supply_net VDD1V_MEM -ports { uodmy/Uodm_core_Uodm_axi_slave/Uaxi_slave_rch1_Uaxi_slave_dfifo_r_genblk2_Ufp64x166_MEM0/VDDCE }
connect_supply_net VDD1V_MEM -ports { uodmy/Uodm_core_Uodm_axi_slave/Uaxi_slave_rch1_Uaxi_slave_dfifo_r_genblk2_Ufp64x166_MEM1/VDDCE }
connect_supply_net VDD1V_MEM -ports { uodmy/Uodm_core_Uodm_axi_slave/Uaxi_slave_wch0_Uaxi_slave_dfifo_w_genblk2_Ufp64x184_MEM0/VDDCE }
connect_supply_net VDD1V_MEM -ports { uodmy/Uodm_core_Uodm_axi_slave/Uaxi_slave_wch0_Uaxi_slave_dfifo_w_genblk2_Ufp64x184_MEM1/VDDCE }
connect_supply_net VDD1V_MEM -ports { uodmy/Uodm_core_Uodm_ram_ary/Uspbs9216x128e_MEM01/VDDCE }
connect_supply_net VDD1V_MEM -ports { uodmy/Uodm_core_Uodm_ram_ary/Uspbs9216x128e_MEM02/VDDCE }
connect_supply_net VDD1V_MEM -ports { uodmy/Uodm_core_Uodm_ram_ary/Uspbs9216x128e_MEM03/VDDCE }
connect_supply_net VDD1V_MEM -ports { uodmy/Uodm_core_Uodm_ram_ary/Uspbs9216x128e_MEM04/VDDCE }
connect_supply_net VDD1V_MEM -ports { uodmy/Uodm_core_Uodm_ram_ary/Uspbs9216x128e_MEM11/VDDCE }
connect_supply_net VDD1V_MEM -ports { uodmy/Uodm_core_Uodm_ram_ary/Uspbs9216x128e_MEM12/VDDCE }
connect_supply_net VDD1V_MEM -ports { uodmy/Uodm_core_Uodm_ram_ary/Uspbs9216x128e_MEM13/VDDCE }
connect_supply_net VDD1V_MEM -ports { uodmy/Uodm_core_Uodm_ram_ary/Uspbs9216x128e_MEM14/VDDCE }
connect_supply_net VDD1V_MEM -ports { uodmy/Uodm_core_Uodm_ram_ary/Uspbs9216x128e_MEM21/VDDCE }
connect_supply_net VDD1V_MEM -ports { uodmy/Uodm_core_Uodm_ram_ary/Uspbs9216x128e_MEM22/VDDCE }
connect_supply_net VDD1V_MEM -ports { uodmy/Uodm_core_Uodm_ram_ary/Uspbs9216x128e_MEM23/VDDCE }
connect_supply_net VDD1V_MEM -ports { uodmy/Uodm_core_Uodm_ram_ary/Uspbs9216x128e_MEM24/VDDCE }
connect_supply_net VDD1V_MEM -ports { uodmy/Uodm_core_Uodm_ram_ary/Uspbs9216x128e_MEM31/VDDCE }
connect_supply_net VDD1V_MEM -ports { uodmy/Uodm_core_Uodm_ram_ary/Uspbs9216x128e_MEM32/VDDCE }
connect_supply_net VDD1V_MEM -ports { uodmy/Uodm_core_Uodm_ram_ary/Uspbs9216x128e_MEM33/VDDCE }
connect_supply_net VDD1V_MEM -ports { uodmy/Uodm_core_Uodm_ram_ary/Uspbs9216x128e_MEM34/VDDCE }
connect_supply_net VDD1V_MEM -ports { uodmy/Uodm_core_Uodm_ram_ary/Uspbs9216x128e_MEM41/VDDCE }
connect_supply_net VDD1V_MEM -ports { uodmy/Uodm_core_Uodm_ram_ary/Uspbs9216x128e_MEM42/VDDCE }
connect_supply_net VDD1V_MEM -ports { uodmy/Uodm_core_Uodm_ram_ary/Uspbs9216x128e_MEM43/VDDCE }
connect_supply_net VDD1V_MEM -ports { uodmy/Uodm_core_Uodm_ram_ary/Uspbs9216x128e_MEM44/VDDCE }
connect_supply_net VDD1V_MEM -ports { uodmy/Uodm_core_Uodm_ram_ary/Uspbs9216x128e_MEM51/VDDCE }
connect_supply_net VDD1V_MEM -ports { uodmy/Uodm_core_Uodm_ram_ary/Uspbs9216x128e_MEM52/VDDCE }
connect_supply_net VDD1V_MEM -ports { uodmy/Uodm_core_Uodm_ram_ary/Uspbs9216x128e_MEM53/VDDCE }
connect_supply_net VDD1V_MEM -ports { uodmy/Uodm_core_Uodm_ram_ary/Uspbs9216x128e_MEM54/VDDCE }
connect_supply_net VDD1V_MEM -ports { uodmy/Uodm_core_Uodm_ram_ary/Uspbs9216x128o_MEM01/VDDCE }
connect_supply_net VDD1V_MEM -ports { uodmy/Uodm_core_Uodm_ram_ary/Uspbs9216x128o_MEM02/VDDCE }
connect_supply_net VDD1V_MEM -ports { uodmy/Uodm_core_Uodm_ram_ary/Uspbs9216x128o_MEM03/VDDCE }
connect_supply_net VDD1V_MEM -ports { uodmy/Uodm_core_Uodm_ram_ary/Uspbs9216x128o_MEM04/VDDCE }
connect_supply_net VDD1V_MEM -ports { uodmy/Uodm_core_Uodm_ram_ary/Uspbs9216x128o_MEM11/VDDCE }
connect_supply_net VDD1V_MEM -ports { uodmy/Uodm_core_Uodm_ram_ary/Uspbs9216x128o_MEM12/VDDCE }
connect_supply_net VDD1V_MEM -ports { uodmy/Uodm_core_Uodm_ram_ary/Uspbs9216x128o_MEM13/VDDCE }
connect_supply_net VDD1V_MEM -ports { uodmy/Uodm_core_Uodm_ram_ary/Uspbs9216x128o_MEM14/VDDCE }
connect_supply_net VDD1V_MEM -ports { uodmy/Uodm_core_Uodm_ram_ary/Uspbs9216x128o_MEM21/VDDCE }
connect_supply_net VDD1V_MEM -ports { uodmy/Uodm_core_Uodm_ram_ary/Uspbs9216x128o_MEM22/VDDCE }
connect_supply_net VDD1V_MEM -ports { uodmy/Uodm_core_Uodm_ram_ary/Uspbs9216x128o_MEM23/VDDCE }
connect_supply_net VDD1V_MEM -ports { uodmy/Uodm_core_Uodm_ram_ary/Uspbs9216x128o_MEM24/VDDCE }
connect_supply_net VDD1V_MEM -ports { uodmy/Uodm_core_Uodm_ram_ary/Uspbs9216x128o_MEM31/VDDCE }
connect_supply_net VDD1V_MEM -ports { uodmy/Uodm_core_Uodm_ram_ary/Uspbs9216x128o_MEM32/VDDCE }
connect_supply_net VDD1V_MEM -ports { uodmy/Uodm_core_Uodm_ram_ary/Uspbs9216x128o_MEM33/VDDCE }
connect_supply_net VDD1V_MEM -ports { uodmy/Uodm_core_Uodm_ram_ary/Uspbs9216x128o_MEM34/VDDCE }
connect_supply_net VDD1V_MEM -ports { uodmy/Uodm_core_Uodm_ram_ary/Uspbs9216x128o_MEM41/VDDCE }
connect_supply_net VDD1V_MEM -ports { uodmy/Uodm_core_Uodm_ram_ary/Uspbs9216x128o_MEM42/VDDCE }
connect_supply_net VDD1V_MEM -ports { uodmy/Uodm_core_Uodm_ram_ary/Uspbs9216x128o_MEM43/VDDCE }
connect_supply_net VDD1V_MEM -ports { uodmy/Uodm_core_Uodm_ram_ary/Uspbs9216x128o_MEM44/VDDCE }
connect_supply_net VDD1V_MEM -ports { uodmy/Uodm_core_Uodm_ram_ary/Uspbs9216x128o_MEM51/VDDCE }
connect_supply_net VDD1V_MEM -ports { uodmy/Uodm_core_Uodm_ram_ary/Uspbs9216x128o_MEM52/VDDCE }
connect_supply_net VDD1V_MEM -ports { uodmy/Uodm_core_Uodm_ram_ary/Uspbs9216x128o_MEM53/VDDCE }
connect_supply_net VDD1V_MEM -ports { uodmy/Uodm_core_Uodm_ram_ary/Uspbs9216x128o_MEM54/VDDCE }
connect_supply_net VDD1V_MEM -ports { uodmy/Uodm_core_Uodm_ram_ary/Uspbs9216x32e_MEM0/VDDCE }
connect_supply_net VDD1V_MEM -ports { uodmy/Uodm_core_Uodm_ram_ary/Uspbs9216x32e_MEM1/VDDCE }
connect_supply_net VDD1V_MEM -ports { uodmy/Uodm_core_Uodm_ram_ary/Uspbs9216x32e_MEM2/VDDCE }
connect_supply_net VDD1V_MEM -ports { uodmy/Uodm_core_Uodm_ram_ary/Uspbs9216x32e_MEM3/VDDCE }
connect_supply_net VDD1V_MEM -ports { uodmy/Uodm_core_Uodm_ram_ary/Uspbs9216x32e_MEM4/VDDCE }
connect_supply_net VDD1V_MEM -ports { uodmy/Uodm_core_Uodm_ram_ary/Uspbs9216x32e_MEM5/VDDCE }
connect_supply_net VDD1V_MEM -ports { uodmy/Uodm_core_Uodm_ram_ary/Uspbs9216x32o_MEM0/VDDCE }
connect_supply_net VDD1V_MEM -ports { uodmy/Uodm_core_Uodm_ram_ary/Uspbs9216x32o_MEM1/VDDCE }
connect_supply_net VDD1V_MEM -ports { uodmy/Uodm_core_Uodm_ram_ary/Uspbs9216x32o_MEM2/VDDCE }
connect_supply_net VDD1V_MEM -ports { uodmy/Uodm_core_Uodm_ram_ary/Uspbs9216x32o_MEM3/VDDCE }
connect_supply_net VDD1V_MEM -ports { uodmy/Uodm_core_Uodm_ram_ary/Uspbs9216x32o_MEM4/VDDCE }
connect_supply_net VDD1V_MEM -ports { uodmy/Uodm_core_Uodm_ram_ary/Uspbs9216x32o_MEM5/VDDCE }
connect_supply_net VDD1V_MEM -ports { uscMatrix/uusc_mpu16_umc_mpumem_gen_dp1024x16_gen_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uuec/uACDWrap/uRamNGH0_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uuec/uACDWrap/uRamNGH1_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uuec/uACDWrap/uRamPSTTM_MEM0/VDDCE }
connect_supply_net VDD1V_MEM -ports { uuec/uACDWrap/uRamPSTTM_MEM1/VDDCE }
connect_supply_net VDD1V_MEM -ports { uuec/uCABAD/uACDWrap2/uRamNGH0_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uuec/uCABAD/uACDWrap2/uRamNGH1_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uuec/uCABAD/uACDWrap2/uRamPSTTM_MEM0/VDDCE }
connect_supply_net VDD1V_MEM -ports { uuec/uCABAD/uACDWrap2/uRamPSTTM_MEM1/VDDCE }
connect_supply_net VDD1V_MEM -ports { uuec/uCABAD/uStrDec/uDPS_uSTDDPStrgBuf_u_sp64x32_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uuec/uCABAD/uStrDec/uMV_uCore_uAdjM_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uuec/uCABAD/uStrDec/uNVD_nv_bitstream_parser_inst_bp_fifo_inst_bp_fp128x32_wrapper_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uuec/uCABAD/uStrDec/uSDP_uBlkFIFO_genblk2_StrDecLvlFIFO_u_fp512x64_MEM0/VDDCE }
connect_supply_net VDD1V_MEM -ports { uuec/uCABAD/uStrDec/uSDP_uBlkFIFO_genblk2_StrDecLvlFIFO_u_fp512x64_MEM1/VDDCE }
connect_supply_net VDD1V_MEM -ports { uuec/uCABAD/uStrDec/uSDP_uMbHdrFIFO_genblk2_StrDecMbHdrFIFO_u_fp512x100_MEM00/VDDCE }
connect_supply_net VDD1V_MEM -ports { uuec/uCABAD/uStrDec/uSDP_uMbHdrFIFO_genblk2_StrDecMbHdrFIFO_u_fp512x100_MEM01/VDDCE }
connect_supply_net VDD1V_MEM -ports { uuec/uCABAD/uStrDec/uSDP_uMbHdrFIFO_genblk2_StrDecMbHdrFIFO_u_fp512x100_MEM10/VDDCE }
connect_supply_net VDD1V_MEM -ports { uuec/uCABAD/uStrDec/uSDP_uMbHdrFIFO_genblk2_StrDecMbHdrFIFO_u_fp512x100_MEM11/VDDCE }
connect_supply_net VDD1V_MEM -ports { uuec/uCABAD/uStrDec/uSDP_uMvdFIFO_genblk2_StrDecMvdFIFO_u_fp256x26_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uuec/uCABAD/uStrDec/uSDP_uPrdFIFO_genblk2_StrDecPrdFIFO_u_fp256x32_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uuec/uCABAD/uStrDec/uSDP_uScmFIFO_genblk2_StrDecScmFIFO_u_fp256x64_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uuec/uCABAD/uStrDec/uSLD_CONTEXT_TOP_RAM_cnxt_ram_top_int_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uuec/uCABAD/uStrDec/uSLD_slice_bitstream_parser_inst_bp_fifo_inst_bp_fp256x24_wrapper_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uuec/uCABAD/uStrDec/uSPL_uFIFO_genblk2_StrDecSpltFIFO_u_fp256x33_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uuec/uDDRRMst/uMst32/Uaxi_master_r_uif0_Uaxi_master_dfifo_r_genblk2_Ufp256x32_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uuec/uDDRRMst/uMst32/Uaxi_master_r_uif1_Uaxi_master_dfifo_r_genblk2_Ufp256x32_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uuec/uDDRRMst/uMst32/Uaxi_master_r_uif2_Uaxi_master_dfifo_r_genblk2_Ufp256x32_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uuec/uDDRRMst/uMst32/Uaxi_master_r_uif3_Uaxi_master_dfifo_r_genblk2_Ufp256x32_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uuec/uDDRRMst/uMst32/Uaxi_master_r_uif4_Uaxi_master_dfifo_r_genblk2_Ufp256x32_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uuec/uDDRWMst/uMst32/Uaxi_master_w_uif0_Uaxi_master_dfifo_w_genblk2_Ufp256x36_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uuec/uDDRWMst/uMst32/Uaxi_master_w_uif1_Uaxi_master_dfifo_w_genblk2_Ufp128x36_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uuec/uDDRWMst/uMst32/Uaxi_master_w_uif2_Uaxi_master_dfifo_w_genblk2_Ufp256x36_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uuec/uDDRWMst/uMst32/Uaxi_master_w_uif3_Uaxi_master_dfifo_w_genblk2_Ufp128x36_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uuec/uDDRWMst/uMst32/Uaxi_master_w_uif4_Uaxi_master_dfifo_w_genblk2_Ufp256x36_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uuec/uDDRWMst/uMst32/Uaxi_master_w_uif5_Uaxi_master_dfifo_w_genblk2_Ufp256x36_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uuec/uDDRWMst/uMst32/Uaxi_master_w_uif6_Uaxi_master_dfifo_w_genblk2_Ufp256x36_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uuec/uDDRWMst/uMst32/Uaxi_master_w_uif7_Uaxi_master_dfifo_w_genblk2_Ufp256x36_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uuec/uNVEnc/uPrc/uRBSP_u_sps64x32_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uuec/uNVEnc/uStt/uRAM_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uuec/uOCMRMst/uMst32/Uaxi_master_r_uif0_Uaxi_master_dfifo_r_genblk2_Ufp256x64_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uuec/uOCMRMst/uMst32/Uaxi_master_r_uif1_Uaxi_master_cfifo_genblk2_Ufp64x36_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uuec/uOCMRMst/uMst32/Uaxi_master_r_uif1_Uaxi_master_dfifo_r_genblk2_Ufp512x64_MEM0/VDDCE }
connect_supply_net VDD1V_MEM -ports { uuec/uOCMRMst/uMst32/Uaxi_master_r_uif1_Uaxi_master_dfifo_r_genblk2_Ufp512x64_MEM1/VDDCE }
connect_supply_net VDD1V_MEM -ports { uuec/uOCMRMst/uMst32/Uaxi_master_r_uif2_Uaxi_master_cfifo_genblk2_Ufp64x36_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uuec/uOCMRMst/uMst32/Uaxi_master_r_uif2_Uaxi_master_dfifo_r_genblk2_Ufp512x64_MEM0/VDDCE }
connect_supply_net VDD1V_MEM -ports { uuec/uOCMRMst/uMst32/Uaxi_master_r_uif2_Uaxi_master_dfifo_r_genblk2_Ufp512x64_MEM1/VDDCE }
connect_supply_net VDD1V_MEM -ports { uuec/uOCMWMst/uMst32/Uaxi_master_w_uif0_Uaxi_master_cfifo_genblk2_Ufp64x36_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uuec/uOCMWMst/uMst32/Uaxi_master_w_uif0_Uaxi_master_dfifo_w_genblk2_Ufp512x72_MEM0/VDDCE }
connect_supply_net VDD1V_MEM -ports { uuec/uOCMWMst/uMst32/Uaxi_master_w_uif0_Uaxi_master_dfifo_w_genblk2_Ufp512x72_MEM1/VDDCE }
connect_supply_net VDD1V_MEM -ports { uuec/uOCMWMst/uMst32/Uaxi_master_w_uif1_Uaxi_master_dfifo_w_genblk2_Ufp128x72_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uuec/uOCMWMst/uMst32/Uaxi_master_w_uif2_Uaxi_master_dfifo_w_genblk2_Ufp128x72_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uuec/uOCMWMst/uMst32/Uaxi_master_w_uif3_Uaxi_master_dfifo_w_genblk2_Ufp128x72_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uuec/uOCMWMst/uMst32/Uaxi_master_w_uif4_Uaxi_master_dfifo_w_genblk2_Ufp128x72_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uuec/uP1Est/uBuf/uRAMC_LBL_LvlC_FP_u_fp1024x20_MEM0/VDDCE }
connect_supply_net VDD1V_MEM -ports { uuec/uP1Est/uBuf/uRAMC_LBL_LvlC_FP_u_fp1024x20_MEM1/VDDCE }
connect_supply_net VDD1V_MEM -ports { uuec/uP1Est/uBuf/uRAMC_LBL_LvlC_FP_u_fp1024x20_MEM2/VDDCE }
connect_supply_net VDD1V_MEM -ports { uuec/uP1Est/uBuf/uRAMC_LBL_LvlC_FP_u_fp1024x20_MEM3/VDDCE }
connect_supply_net VDD1V_MEM -ports { uuec/uP1Est/uBuf/uRAMY_LBL_LvlY_FP_u_fp512x20_MEM0/VDDCE }
connect_supply_net VDD1V_MEM -ports { uuec/uP1Est/uBuf/uRAMY_LBL_LvlY_FP_u_fp512x20_MEM1/VDDCE }
connect_supply_net VDD1V_MEM -ports { uuec/uP1Est/uCore/uBAC_uDFAC_uBuf_uRAMC0_uRAM_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uuec/uP1Est/uCore/uBAC_uDFAC_uBuf_uRAMC1_uRAM_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uuec/uP1Est/uCore/uBAC_uDFAC_uBuf_uRAMI_uRAM_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uuec/uP1Est/uCore/uBAC_uDFAY_uBuf_uRAMC0_uRAM_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uuec/uP1Est/uCore/uBAC_uDFAY_uBuf_uRAMC1_uRAM_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uuec/uP1Est/uCore/uBAC_uDFAY_uBuf_uRAMI_uRAM_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uuec/uP1Est/uCore/uBAC_uRAMCC0_uRAM_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uuec/uP1Est/uCore/uBAC_uRAMCCn_uRAM_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uuec/uP1Est/uCore/uBAC_uRAMCSF_uRAM_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uuec/uP1Est/uCore/uBAC_uRAMCSL_uRAM_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uuec/uP1Est/uCore/uBAC_uRAMYC0_uRAM_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uuec/uP1Est/uCore/uBAC_uRAMYCn_uRAM_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uuec/uP1Est/uCore/uBAC_uRAMYSF_uRAM_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uuec/uP1Est/uCore/uBAC_uRAMYSL_uRAM_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uuec/uP1Est/uCore/uVLC_uEstC_uScn_uCBuf0_uRAM_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uuec/uP1Est/uCore/uVLC_uEstC_uScn_uCBuf1_uRAM_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uuec/uP1Est/uCore/uVLC_uEstCb_uScn_uCBuf0_uRAM_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uuec/uP1Est/uCore/uVLC_uEstCb_uScn_uCBuf1_uRAM_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uuec/uP1Est/uCore/uVLC_uEstCr_uScn_uCBuf0_uRAM_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uuec/uP1Est/uCore/uVLC_uEstCr_uScn_uCBuf1_uRAM_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uuec/uP1Est/uCore/uVLC_uEstY_uScn_uCBuf0_uRAM_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uuec/uP1Est/uCore/uVLC_uEstY_uScn_uCBuf1_uRAM_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uuec/uP1Est/uRtn/uRAM_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uuec/uStrDec/uDPS/uSTDDPStrgBuf_u_sp64x32_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uuec/uStrDec/uMV/uCore_uAdjM_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uuec/uStrDec/uNVD/nv_bitstream_parser_inst_bp_fifo_inst_bp_fp128x32_wrapper_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uuec/uStrDec/uSDP/uBlkFIFO_genblk2_StrDecLvlFIFO_u_fp512x64_MEM0/VDDCE }
connect_supply_net VDD1V_MEM -ports { uuec/uStrDec/uSDP/uBlkFIFO_genblk2_StrDecLvlFIFO_u_fp512x64_MEM1/VDDCE }
connect_supply_net VDD1V_MEM -ports { uuec/uStrDec/uSDP/uMbHdrFIFO_genblk2_StrDecMbHdrFIFO_u_fp512x100_MEM00/VDDCE }
connect_supply_net VDD1V_MEM -ports { uuec/uStrDec/uSDP/uMbHdrFIFO_genblk2_StrDecMbHdrFIFO_u_fp512x100_MEM01/VDDCE }
connect_supply_net VDD1V_MEM -ports { uuec/uStrDec/uSDP/uMbHdrFIFO_genblk2_StrDecMbHdrFIFO_u_fp512x100_MEM10/VDDCE }
connect_supply_net VDD1V_MEM -ports { uuec/uStrDec/uSDP/uMbHdrFIFO_genblk2_StrDecMbHdrFIFO_u_fp512x100_MEM11/VDDCE }
connect_supply_net VDD1V_MEM -ports { uuec/uStrDec/uSDP/uMvdFIFO_genblk2_StrDecMvdFIFO_u_fp256x26_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uuec/uStrDec/uSDP/uPrdFIFO_genblk2_StrDecPrdFIFO_u_fp256x32_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uuec/uStrDec/uSDP/uScmFIFO_genblk2_StrDecScmFIFO_u_fp256x64_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uuec/uStrDec/uSLD/CONTEXT_TOP_RAM_cnxt_ram_top_int_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uuec/uStrDec/uSLD/slice_bitstream_parser_inst_bp_fifo_inst_bp_fp256x24_wrapper_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uuec/uStrDec/uSPL/uFIFO_genblk2_StrDecSpltFIFO_u_fp256x33_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uuec/uStrEnc/uCtrl/uReg_uRAM_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uuec/uVLC/uCBF/uVLCCoefBufRamLvlC_genblk1_LBL_LvlC_u_fp1024x20_MEM0/VDDCE }
connect_supply_net VDD1V_MEM -ports { uuec/uVLC/uCBF/uVLCCoefBufRamLvlC_genblk1_LBL_LvlC_u_fp1024x20_MEM1/VDDCE }
connect_supply_net VDD1V_MEM -ports { uuec/uVLC/uCBF/uVLCCoefBufRamLvlC_genblk1_LBL_LvlC_u_fp1024x20_MEM2/VDDCE }
connect_supply_net VDD1V_MEM -ports { uuec/uVLC/uCBF/uVLCCoefBufRamLvlC_genblk1_LBL_LvlC_u_fp1024x20_MEM3/VDDCE }
connect_supply_net VDD1V_MEM -ports { uuec/uVLC/uCBF/uVLCCoefBufRamLvlY_genblk1_LBL_LvlY_u_fp512x20_MEM0/VDDCE }
connect_supply_net VDD1V_MEM -ports { uuec/uVLC/uCBF/uVLCCoefBufRamLvlY_genblk1_LBL_LvlY_u_fp512x20_MEM1/VDDCE }
connect_supply_net VDD1V_MEM -ports { uuec/uVLC/uCBF/uVLCCoefBufRamSplC_genblk1_LBL_SplC_u_fp1024x12_MEM0/VDDCE }
connect_supply_net VDD1V_MEM -ports { uuec/uVLC/uCBF/uVLCCoefBufRamSplC_genblk1_LBL_SplC_u_fp1024x12_MEM1/VDDCE }
connect_supply_net VDD1V_MEM -ports { uuec/uVLC/uCBF/uVLCCoefBufRamSplC_genblk1_LBL_SplC_u_fp1024x12_MEM2/VDDCE }
connect_supply_net VDD1V_MEM -ports { uuec/uVLC/uCBF/uVLCCoefBufRamSplC_genblk1_LBL_SplC_u_fp1024x12_MEM3/VDDCE }
connect_supply_net VDD1V_MEM -ports { uuec/uVLC/uCBF/uVLCCoefBufRamSplY_genblk1_LBL_SplY_u_fp512x12_MEM0/VDDCE }
connect_supply_net VDD1V_MEM -ports { uuec/uVLC/uCBF/uVLCCoefBufRamSplY_genblk1_LBL_SplY_u_fp512x12_MEM1/VDDCE }
connect_supply_net VDD1V_MEM -ports { uuec/uVLC/uCLP/uRAM_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uuec/uVLC/uCORE/CABAC_cabac_inst_cabac_chroma_controller_inst_genblk1_cabac_ch_top_cbf_ram_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uuec/uVLC/uCORE/CABAC_cabac_inst_cabac_mb_header_cntrl_inst_genblk1_cabac_mb_ram0_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uuec/uVLC/uCORE/CAVLC_cavlc_inst_genblk1_nB_ram0_256x16_luma_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uuec/uVLC/uCORE/CAVLC_cavlc_inst_genblk1_nB_ram1_256x8_luma_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uuec/uVLC/uCORE/vlccore_controller_inst_genblk1_fp1024x32_inst_MEM0/VDDCE }
connect_supply_net VDD1V_MEM -ports { uuec/uVLC/uCORE/vlccore_controller_inst_genblk1_fp1024x32_inst_MEM1/VDDCE }
connect_supply_net VDD1V_MEM -ports { uuec/uVLC/uCORE/vlccore_controller_inst_genblk1_fp1024x32_inst_MEM2/VDDCE }
connect_supply_net VDD1V_MEM -ports { uuec/uVLC/uCORE/vlccore_controller_inst_genblk1_fp1024x32_inst_MEM3/VDDCE }
connect_supply_net VDD1V_MEM -ports { uuec/uVLC/uCORE/vlccore_controller_inst_genblk2_fp512x16_inst_MEM0/VDDCE }
connect_supply_net VDD1V_MEM -ports { uuec/uVLC/uCORE/vlccore_controller_inst_genblk2_fp512x16_inst_MEM1/VDDCE }
connect_supply_net VDD1V_MEM -ports { uuec/uVLC/uCORE/vlccore_controller_inst_genblk3_fp256x16_inst_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uuec/uVLC/uCORE/vlccore_controller_inst_genblk4_fp256x8_inst_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uuec/uVLC/uCORE/vlccore_controller_inst_genblk5_fp512x32_inst_MEM0/VDDCE }
connect_supply_net VDD1V_MEM -ports { uuec/uVLC/uCORE/vlccore_controller_inst_genblk5_fp512x32_inst_MEM1/VDDCE }
connect_supply_net VDD1V_MEM -ports { uuec/uVLC/uCTL/uVLCCtrlReg_uPRAM_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uuec/uVLC/uDst/uIFRAM_uARAM_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uuec/uVLC/uEst/uHM_uSeq_uFIFO_uFIFO_genblk2_VLCEstHMSeqFIFO_u_fp64x32_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uuec/uVLC/uPCK/uVLCPckLvlC_VLCCCDat_u_sps512x64_0_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uuec/uVLC/uPCK/uVLCPckLvlC_VLCCCDat_u_sps512x64_1_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uuec/uVLC/uPCK/uVLCPckLvlY_VLCYCDat_u_sps256x64_0_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uuec/uVLC/uPCK/uVLCPckLvlY_VLCYCDat_u_sps256x64_1_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uuec/uVLC/uPCK/uVLCPckM_VLCM_u_sps64x64_0_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uuec/uVLC/uPCK/uVLCPckM_VLCM_u_sps64x64_1_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uuec/uVLC/uPCK/uVLCPckScfC_VLCCSDat_u_sps32x64_0_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uuec/uVLC/uPCK/uVLCPckScfC_VLCCSDat_u_sps32x64_1_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uuec/uVLC/uSCN/uVLCScnIPcmPrcC_uVLCScnIPcmRam_LBL_IPcmC_u_sps128x64_0_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uuec/uVLC/uSCN/uVLCScnIPcmPrcC_uVLCScnIPcmRam_LBL_IPcmC_u_sps128x64_1_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uuec/uVLC/uSCN/uVLCScnIPcmPrcC_uVLCScnIPcmRam_LBL_IPcmC_u_sps128x64_2_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uuec/uVLC/uSCN/uVLCScnIPcmPrcY_uVLCScnIPcmRam_LBL_IPcmY_u_sp64x64_1_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uuec/uVLC/uSCN/uVLCScnIPcmPrcY_uVLCScnIPcmRam_LBL_IPcmY_u_sp64x64_2_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uuec/uVLC/uSCN/uVLCScnIPcmPrcY_uVLCScnIPcmRam_LBL_IPcmY_u_sps64x64_0_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uuec/uVLC/uSCN/uVLCScnLvlPrcC_uVLCScnN0LvlRam_LBL_Non0LvlC_u_fp1024x20_MEM0/VDDCE }
connect_supply_net VDD1V_MEM -ports { uuec/uVLC/uSCN/uVLCScnLvlPrcC_uVLCScnN0LvlRam_LBL_Non0LvlC_u_fp1024x20_MEM1/VDDCE }
connect_supply_net VDD1V_MEM -ports { uuec/uVLC/uSCN/uVLCScnLvlPrcC_uVLCScnN0LvlRam_LBL_Non0LvlC_u_fp1024x20_MEM2/VDDCE }
connect_supply_net VDD1V_MEM -ports { uuec/uVLC/uSCN/uVLCScnLvlPrcC_uVLCScnN0LvlRam_LBL_Non0LvlC_u_fp1024x20_MEM3/VDDCE }
connect_supply_net VDD1V_MEM -ports { uuec/uVLC/uSCN/uVLCScnLvlPrcY_uVLCScnN0LvlRam_LBL_Non0LvlY_u_fp512x20_MEM0/VDDCE }
connect_supply_net VDD1V_MEM -ports { uuec/uVLC/uSCN/uVLCScnLvlPrcY_uVLCScnN0LvlRam_LBL_Non0LvlY_u_fp512x20_MEM1/VDDCE }
connect_supply_net VDD1V_MEM -ports { uuec/uVLC/uSTP/uRAM_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uuec/uVLD/uC0FIFO/genblk2_VldCLvlFIFO_u_fp1024x20_MEM0/VDDCE }
connect_supply_net VDD1V_MEM -ports { uuec/uVLD/uC0FIFO/genblk2_VldCLvlFIFO_u_fp1024x20_MEM1/VDDCE }
connect_supply_net VDD1V_MEM -ports { uuec/uVLD/uC0FIFO/genblk2_VldCLvlFIFO_u_fp1024x20_MEM2/VDDCE }
connect_supply_net VDD1V_MEM -ports { uuec/uVLD/uC0FIFO/genblk2_VldCLvlFIFO_u_fp1024x20_MEM3/VDDCE }
connect_supply_net VDD1V_MEM -ports { uuec/uVLD/uC1FIFO/genblk2_VldCLvlFIFO_u_fp1024x20_MEM0/VDDCE }
connect_supply_net VDD1V_MEM -ports { uuec/uVLD/uC1FIFO/genblk2_VldCLvlFIFO_u_fp1024x20_MEM1/VDDCE }
connect_supply_net VDD1V_MEM -ports { uuec/uVLD/uC1FIFO/genblk2_VldCLvlFIFO_u_fp1024x20_MEM2/VDDCE }
connect_supply_net VDD1V_MEM -ports { uuec/uVLD/uC1FIFO/genblk2_VldCLvlFIFO_u_fp1024x20_MEM3/VDDCE }
connect_supply_net VDD1V_MEM -ports { uuec/uVLD/uCtl/uReg_uRAM_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uuec/uVLD/uPrd0FIFO/genblk2_VldPrdMvdFIFO_u_fp256x16_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uuec/uVLD/uPrd1FIFO/genblk2_VldPrdMvdFIFO_u_fp256x16_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uuec/uVLD/uY0FIFO/genblk2_VldYLvlFIFO_u_fp512x20_MEM0/VDDCE }
connect_supply_net VDD1V_MEM -ports { uuec/uVLD/uY0FIFO/genblk2_VldYLvlFIFO_u_fp512x20_MEM1/VDDCE }
connect_supply_net VDD1V_MEM -ports { uuec/uVLD/uY1FIFO/genblk2_VldYLvlFIFO_u_fp512x20_MEM0/VDDCE }
connect_supply_net VDD1V_MEM -ports { uuec/uVLD/uY1FIFO/genblk2_VldYLvlFIFO_u_fp512x20_MEM1/VDDCE }
connect_supply_net VDD1V_MEM -ports { uume/Uume_core_Uume_me_core/Uume_mei/Uume_mei_msbm_GenRAM_0__Ufp512x40_MEM0/VDDCE }
connect_supply_net VDD1V_MEM -ports { uume/Uume_core_Uume_me_core/Uume_mei/Uume_mei_msbm_GenRAM_0__Ufp512x40_MEM1/VDDCE }
connect_supply_net VDD1V_MEM -ports { uume/Uume_core_Uume_me_core/Uume_mei/Uume_mei_msbm_GenRAM_10__Ufp512x40_MEM0/VDDCE }
connect_supply_net VDD1V_MEM -ports { uume/Uume_core_Uume_me_core/Uume_mei/Uume_mei_msbm_GenRAM_10__Ufp512x40_MEM1/VDDCE }
connect_supply_net VDD1V_MEM -ports { uume/Uume_core_Uume_me_core/Uume_mei/Uume_mei_msbm_GenRAM_11__Ufp512x40_MEM0/VDDCE }
connect_supply_net VDD1V_MEM -ports { uume/Uume_core_Uume_me_core/Uume_mei/Uume_mei_msbm_GenRAM_11__Ufp512x40_MEM1/VDDCE }
connect_supply_net VDD1V_MEM -ports { uume/Uume_core_Uume_me_core/Uume_mei/Uume_mei_msbm_GenRAM_1__Ufp512x40_MEM0/VDDCE }
connect_supply_net VDD1V_MEM -ports { uume/Uume_core_Uume_me_core/Uume_mei/Uume_mei_msbm_GenRAM_1__Ufp512x40_MEM1/VDDCE }
connect_supply_net VDD1V_MEM -ports { uume/Uume_core_Uume_me_core/Uume_mei/Uume_mei_msbm_GenRAM_2__Ufp512x40_MEM0/VDDCE }
connect_supply_net VDD1V_MEM -ports { uume/Uume_core_Uume_me_core/Uume_mei/Uume_mei_msbm_GenRAM_2__Ufp512x40_MEM1/VDDCE }
connect_supply_net VDD1V_MEM -ports { uume/Uume_core_Uume_me_core/Uume_mei/Uume_mei_msbm_GenRAM_3__Ufp512x40_MEM0/VDDCE }
connect_supply_net VDD1V_MEM -ports { uume/Uume_core_Uume_me_core/Uume_mei/Uume_mei_msbm_GenRAM_3__Ufp512x40_MEM1/VDDCE }
connect_supply_net VDD1V_MEM -ports { uume/Uume_core_Uume_me_core/Uume_mei/Uume_mei_msbm_GenRAM_4__Ufp512x40_MEM0/VDDCE }
connect_supply_net VDD1V_MEM -ports { uume/Uume_core_Uume_me_core/Uume_mei/Uume_mei_msbm_GenRAM_4__Ufp512x40_MEM1/VDDCE }
connect_supply_net VDD1V_MEM -ports { uume/Uume_core_Uume_me_core/Uume_mei/Uume_mei_msbm_GenRAM_5__Ufp512x40_MEM0/VDDCE }
connect_supply_net VDD1V_MEM -ports { uume/Uume_core_Uume_me_core/Uume_mei/Uume_mei_msbm_GenRAM_5__Ufp512x40_MEM1/VDDCE }
connect_supply_net VDD1V_MEM -ports { uume/Uume_core_Uume_me_core/Uume_mei/Uume_mei_msbm_GenRAM_6__Ufp512x40_MEM0/VDDCE }
connect_supply_net VDD1V_MEM -ports { uume/Uume_core_Uume_me_core/Uume_mei/Uume_mei_msbm_GenRAM_6__Ufp512x40_MEM1/VDDCE }
connect_supply_net VDD1V_MEM -ports { uume/Uume_core_Uume_me_core/Uume_mei/Uume_mei_msbm_GenRAM_7__Ufp512x40_MEM0/VDDCE }
connect_supply_net VDD1V_MEM -ports { uume/Uume_core_Uume_me_core/Uume_mei/Uume_mei_msbm_GenRAM_7__Ufp512x40_MEM1/VDDCE }
connect_supply_net VDD1V_MEM -ports { uume/Uume_core_Uume_me_core/Uume_mei/Uume_mei_msbm_GenRAM_8__Ufp512x40_MEM0/VDDCE }
connect_supply_net VDD1V_MEM -ports { uume/Uume_core_Uume_me_core/Uume_mei/Uume_mei_msbm_GenRAM_8__Ufp512x40_MEM1/VDDCE }
connect_supply_net VDD1V_MEM -ports { uume/Uume_core_Uume_me_core/Uume_mei/Uume_mei_msbm_GenRAM_9__Ufp512x40_MEM0/VDDCE }
connect_supply_net VDD1V_MEM -ports { uume/Uume_core_Uume_me_core/Uume_mei/Uume_mei_msbm_GenRAM_9__Ufp512x40_MEM1/VDDCE }
connect_supply_net VDD1V_MEM -ports { uume/Uume_core_Uume_me_core/Uume_mhq/Uume_mhq_mhrm_GenRAM_0__Ufpbn128x36_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uume/Uume_core_Uume_me_core/Uume_mhq/Uume_mhq_mhrm_GenRAM_1__Ufpbn128x36_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uume/Uume_core_Uume_me_core/Uume_mhq/Uume_mhq_mhrm_GenRAM_2__Ufpbn128x36_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uume/Uume_core_Uume_me_core/Uume_mhq/Uume_mhq_mhrm_GenRAM_3__Ufpbn128x36_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uume/Uume_core_Uume_me_core/Uume_mhq/Uume_mhq_mhrm_Ufpb128x64_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uume/Uume_core_Uume_me_core/Uume_mhq/Uume_mhq_mhrm_genblk7_Ufp128x16_b_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uume/Uume_core_Uume_me_sctrl/Uume_mes_mei/Uume_mes_gme_mem_Ufp112x22_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uume/Uume_core_Uume_me_sctrl/Uume_mes_mei/Uume_sam_Uume_sam_mc_mem_Uspbs256x64_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uume/Uume_core_Uume_me_sctrl/Uume_mes_mhq/Uume_sam_Uume_sam_mc_mem_Uspbs256x64_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uume/Uume_core_Uume_me_sctrl/Uume_mes_mv_mem/Ufp257x14_l0h_MEM0/VDDCE }
connect_supply_net VDD1V_MEM -ports { uume/Uume_core_Uume_me_sctrl/Uume_mes_mv_mem/Ufp257x14_l0h_MEM1/VDDCE }
connect_supply_net VDD1V_MEM -ports { uume/Uume_core_Uume_me_sctrl/Uume_mes_mv_mem/Ufp257x14_l0v_MEM0/VDDCE }
connect_supply_net VDD1V_MEM -ports { uume/Uume_core_Uume_me_sctrl/Uume_mes_mv_mem/Ufp257x14_l0v_MEM1/VDDCE }
connect_supply_net VDD1V_MEM -ports { uume/Uume_core_Uume_me_sctrl/Uume_mes_mv_mem/Ufp257x14_l1h_MEM0/VDDCE }
connect_supply_net VDD1V_MEM -ports { uume/Uume_core_Uume_me_sctrl/Uume_mes_mv_mem/Ufp257x14_l1h_MEM1/VDDCE }
connect_supply_net VDD1V_MEM -ports { uume/Uume_core_Uume_me_sctrl/Uume_mes_mv_mem/Ufp257x14_l1v_MEM0/VDDCE }
connect_supply_net VDD1V_MEM -ports { uume/Uume_core_Uume_me_sctrl/Uume_mes_mv_mem/Ufp257x14_l1v_MEM1/VDDCE }
connect_supply_net VDD1V_MEM -ports { uume/Uume_core_Uume_ocm_dmac/Uume_ocd_axi_r12/Uaxi_master_r_uif0_Uaxi_master_dfifo_r_genblk2_Ufp256x64_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uume/Uume_core_Uume_ocm_dmac/Uume_ocd_axi_r12/Uaxi_master_r_uif10_Uaxi_master_dfifo_r_genblk2_Ufp64x64_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uume/Uume_core_Uume_ocm_dmac/Uume_ocd_axi_r12/Uaxi_master_r_uif11_Uaxi_master_dfifo_r_genblk2_Ufp64x64_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uume/Uume_core_Uume_ocm_dmac/Uume_ocd_axi_r12/Uaxi_master_r_uif1_Uaxi_master_dfifo_r_genblk2_Ufp256x64_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uume/Uume_core_Uume_ocm_dmac/Uume_ocd_axi_r12/Uaxi_master_r_uif2_Uaxi_master_dfifo_r_genblk2_Ufp256x64_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uume/Uume_core_Uume_ocm_dmac/Uume_ocd_axi_r12/Uaxi_master_r_uif3_Uaxi_master_dfifo_r_genblk2_Ufp256x64_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uume/Uume_core_Uume_ocm_dmac/Uume_ocd_axi_r12/Uaxi_master_r_uif4_Uaxi_master_dfifo_r_genblk2_Ufp64x64_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uume/Uume_core_Uume_ocm_dmac/Uume_ocd_axi_r12/Uaxi_master_r_uif5_Uaxi_master_dfifo_r_genblk2_Ufp64x64_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uume/Uume_core_Uume_ocm_dmac/Uume_ocd_axi_r12/Uaxi_master_r_uif6_Uaxi_master_dfifo_r_genblk2_Ufp64x64_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uume/Uume_core_Uume_ocm_dmac/Uume_ocd_axi_r12/Uaxi_master_r_uif7_Uaxi_master_dfifo_r_genblk2_Ufp64x64_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uume/Uume_core_Uume_ocm_dmac/Uume_ocd_axi_r12/Uaxi_master_r_uif8_Uaxi_master_dfifo_r_genblk2_Ufp64x64_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uume/Uume_core_Uume_ocm_dmac/Uume_ocd_axi_r12/Uaxi_master_r_uif9_Uaxi_master_dfifo_r_genblk2_Ufp64x64_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uume/Uume_core_Uume_ocm_dmac/Uume_ocd_axi_w3_c/Uaxi_master_w_uif0_Uaxi_master_dfifo_w_genblk2_Ufp64x160_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uume/Uume_core_Uume_ocm_dmac/Uume_ocd_axi_w3_c/Uaxi_master_w_uif1_Uaxi_master_dfifo_w_genblk2_Ufp64x160_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uume/Uume_core_Uume_ocm_dmac/Uume_ocd_axi_w3_c/Uaxi_master_w_uif2_Uaxi_master_dfifo_w_genblk2_Ufp64x160_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uume/Uume_core_Uume_ocm_dmac/Uume_ocd_axi_w3_y/Uaxi_master_w_uif0_Uaxi_master_dfifo_w_genblk2_Ufp64x160_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uume/Uume_core_Uume_ocm_dmac/Uume_ocd_axi_w3_y/Uaxi_master_w_uif1_Uaxi_master_dfifo_w_genblk2_Ufp64x160_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uume/Uume_core_Uume_ocm_dmac/Uume_ocd_axi_w3_y/Uaxi_master_w_uif2_Uaxi_master_dfifo_w_genblk2_Ufp64x160_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uume/Uume_core_Uume_ocm_dmac/Uume_ocd_o2o_dual_y/Uume_ocd_o2o_dual_ch0_Uume_ocd_dual_ibuf_upr_GenRAM_0__Ufp32x64_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uume/Uume_core_Uume_ocm_dmac/Uume_ocd_o2o_dual_y/Uume_ocd_o2o_dual_ch0_Uume_ocd_dual_ibuf_upr_GenRAM_10__Ufp32x64_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uume/Uume_core_Uume_ocm_dmac/Uume_ocd_o2o_dual_y/Uume_ocd_o2o_dual_ch0_Uume_ocd_dual_ibuf_upr_GenRAM_11__Ufp32x64_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uume/Uume_core_Uume_ocm_dmac/Uume_ocd_o2o_dual_y/Uume_ocd_o2o_dual_ch0_Uume_ocd_dual_ibuf_upr_GenRAM_12__Ufp32x64_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uume/Uume_core_Uume_ocm_dmac/Uume_ocd_o2o_dual_y/Uume_ocd_o2o_dual_ch0_Uume_ocd_dual_ibuf_upr_GenRAM_13__Ufp32x64_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uume/Uume_core_Uume_ocm_dmac/Uume_ocd_o2o_dual_y/Uume_ocd_o2o_dual_ch0_Uume_ocd_dual_ibuf_upr_GenRAM_14__Ufp32x64_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uume/Uume_core_Uume_ocm_dmac/Uume_ocd_o2o_dual_y/Uume_ocd_o2o_dual_ch0_Uume_ocd_dual_ibuf_upr_GenRAM_15__Ufp32x64_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uume/Uume_core_Uume_ocm_dmac/Uume_ocd_o2o_dual_y/Uume_ocd_o2o_dual_ch0_Uume_ocd_dual_ibuf_upr_GenRAM_1__Ufp32x64_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uume/Uume_core_Uume_ocm_dmac/Uume_ocd_o2o_dual_y/Uume_ocd_o2o_dual_ch0_Uume_ocd_dual_ibuf_upr_GenRAM_2__Ufp32x64_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uume/Uume_core_Uume_ocm_dmac/Uume_ocd_o2o_dual_y/Uume_ocd_o2o_dual_ch0_Uume_ocd_dual_ibuf_upr_GenRAM_3__Ufp32x64_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uume/Uume_core_Uume_ocm_dmac/Uume_ocd_o2o_dual_y/Uume_ocd_o2o_dual_ch0_Uume_ocd_dual_ibuf_upr_GenRAM_4__Ufp32x64_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uume/Uume_core_Uume_ocm_dmac/Uume_ocd_o2o_dual_y/Uume_ocd_o2o_dual_ch0_Uume_ocd_dual_ibuf_upr_GenRAM_5__Ufp32x64_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uume/Uume_core_Uume_ocm_dmac/Uume_ocd_o2o_dual_y/Uume_ocd_o2o_dual_ch0_Uume_ocd_dual_ibuf_upr_GenRAM_6__Ufp32x64_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uume/Uume_core_Uume_ocm_dmac/Uume_ocd_o2o_dual_y/Uume_ocd_o2o_dual_ch0_Uume_ocd_dual_ibuf_upr_GenRAM_7__Ufp32x64_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uume/Uume_core_Uume_ocm_dmac/Uume_ocd_o2o_dual_y/Uume_ocd_o2o_dual_ch0_Uume_ocd_dual_ibuf_upr_GenRAM_8__Ufp32x64_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uume/Uume_core_Uume_ocm_dmac/Uume_ocd_o2o_dual_y/Uume_ocd_o2o_dual_ch0_Uume_ocd_dual_ibuf_upr_GenRAM_9__Ufp32x64_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uume/Uume_core_Uume_ocm_dmac/Uume_ocd_o2o_dual_y/Uume_ocd_o2o_dual_ch0_Uume_ocd_rast_ibuf_lwr_Ufpb256x128_MEM0/VDDCE }
connect_supply_net VDD1V_MEM -ports { uume/Uume_core_Uume_ocm_dmac/Uume_ocd_o2o_dual_y/Uume_ocd_o2o_dual_ch0_Uume_ocd_rast_ibuf_lwr_Ufpb256x128_MEM1/VDDCE }
connect_supply_net VDD1V_MEM -ports { uume/Uume_core_Uume_ocm_dmac/Uume_ocd_o2o_dual_y/Uume_ocd_o2o_dual_ch1_Uume_ocd_dual_ibuf_upr_GenRAM_0__Ufp32x64_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uume/Uume_core_Uume_ocm_dmac/Uume_ocd_o2o_dual_y/Uume_ocd_o2o_dual_ch1_Uume_ocd_dual_ibuf_upr_GenRAM_10__Ufp32x64_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uume/Uume_core_Uume_ocm_dmac/Uume_ocd_o2o_dual_y/Uume_ocd_o2o_dual_ch1_Uume_ocd_dual_ibuf_upr_GenRAM_11__Ufp32x64_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uume/Uume_core_Uume_ocm_dmac/Uume_ocd_o2o_dual_y/Uume_ocd_o2o_dual_ch1_Uume_ocd_dual_ibuf_upr_GenRAM_12__Ufp32x64_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uume/Uume_core_Uume_ocm_dmac/Uume_ocd_o2o_dual_y/Uume_ocd_o2o_dual_ch1_Uume_ocd_dual_ibuf_upr_GenRAM_13__Ufp32x64_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uume/Uume_core_Uume_ocm_dmac/Uume_ocd_o2o_dual_y/Uume_ocd_o2o_dual_ch1_Uume_ocd_dual_ibuf_upr_GenRAM_14__Ufp32x64_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uume/Uume_core_Uume_ocm_dmac/Uume_ocd_o2o_dual_y/Uume_ocd_o2o_dual_ch1_Uume_ocd_dual_ibuf_upr_GenRAM_15__Ufp32x64_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uume/Uume_core_Uume_ocm_dmac/Uume_ocd_o2o_dual_y/Uume_ocd_o2o_dual_ch1_Uume_ocd_dual_ibuf_upr_GenRAM_1__Ufp32x64_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uume/Uume_core_Uume_ocm_dmac/Uume_ocd_o2o_dual_y/Uume_ocd_o2o_dual_ch1_Uume_ocd_dual_ibuf_upr_GenRAM_2__Ufp32x64_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uume/Uume_core_Uume_ocm_dmac/Uume_ocd_o2o_dual_y/Uume_ocd_o2o_dual_ch1_Uume_ocd_dual_ibuf_upr_GenRAM_3__Ufp32x64_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uume/Uume_core_Uume_ocm_dmac/Uume_ocd_o2o_dual_y/Uume_ocd_o2o_dual_ch1_Uume_ocd_dual_ibuf_upr_GenRAM_4__Ufp32x64_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uume/Uume_core_Uume_ocm_dmac/Uume_ocd_o2o_dual_y/Uume_ocd_o2o_dual_ch1_Uume_ocd_dual_ibuf_upr_GenRAM_5__Ufp32x64_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uume/Uume_core_Uume_ocm_dmac/Uume_ocd_o2o_dual_y/Uume_ocd_o2o_dual_ch1_Uume_ocd_dual_ibuf_upr_GenRAM_6__Ufp32x64_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uume/Uume_core_Uume_ocm_dmac/Uume_ocd_o2o_dual_y/Uume_ocd_o2o_dual_ch1_Uume_ocd_dual_ibuf_upr_GenRAM_7__Ufp32x64_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uume/Uume_core_Uume_ocm_dmac/Uume_ocd_o2o_dual_y/Uume_ocd_o2o_dual_ch1_Uume_ocd_dual_ibuf_upr_GenRAM_8__Ufp32x64_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uume/Uume_core_Uume_ocm_dmac/Uume_ocd_o2o_dual_y/Uume_ocd_o2o_dual_ch1_Uume_ocd_dual_ibuf_upr_GenRAM_9__Ufp32x64_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uume/Uume_core_Uume_ocm_dmac/Uume_ocd_o2o_dual_y/Uume_ocd_o2o_dual_ch1_Uume_ocd_rast_ibuf_lwr_Ufpb256x128_MEM0/VDDCE }
connect_supply_net VDD1V_MEM -ports { uume/Uume_core_Uume_ocm_dmac/Uume_ocd_o2o_dual_y/Uume_ocd_o2o_dual_ch1_Uume_ocd_rast_ibuf_lwr_Ufpb256x128_MEM1/VDDCE }
connect_supply_net VDD1V_MEM -ports { uume/Uume_core_Uume_ocm_dmac/Uume_ocd_o2t_rast/Uume_ocd_o2t_rast_ch0_Uume_ocd_rast_ibuf_lwr_Ufpb256x128_MEM0/VDDCE }
connect_supply_net VDD1V_MEM -ports { uume/Uume_core_Uume_ocm_dmac/Uume_ocd_o2t_rast/Uume_ocd_o2t_rast_ch0_Uume_ocd_rast_ibuf_lwr_Ufpb256x128_MEM1/VDDCE }
connect_supply_net VDD1V_MEM -ports { uume/Uume_core_Uume_ocm_dmac/Uume_ocd_o2t_rast/Uume_ocd_o2t_rast_ch0_Uume_ocd_rast_ibuf_upr_Ufpb256x128_MEM0/VDDCE }
connect_supply_net VDD1V_MEM -ports { uume/Uume_core_Uume_ocm_dmac/Uume_ocd_o2t_rast/Uume_ocd_o2t_rast_ch0_Uume_ocd_rast_ibuf_upr_Ufpb256x128_MEM1/VDDCE }
connect_supply_net VDD1V_MEM -ports { uume/Uume_core_Uume_ocm_dmac/Uume_ocd_o2t_rast/Uume_ocd_o2t_rast_ch1_Uume_ocd_rast_ibuf_lwr_Ufpb256x128_MEM0/VDDCE }
connect_supply_net VDD1V_MEM -ports { uume/Uume_core_Uume_ocm_dmac/Uume_ocd_o2t_rast/Uume_ocd_o2t_rast_ch1_Uume_ocd_rast_ibuf_lwr_Ufpb256x128_MEM1/VDDCE }
connect_supply_net VDD1V_MEM -ports { uume/Uume_core_Uume_ocm_dmac/Uume_ocd_o2t_rast/Uume_ocd_o2t_rast_ch1_Uume_ocd_rast_ibuf_upr_Ufpb256x128_MEM0/VDDCE }
connect_supply_net VDD1V_MEM -ports { uume/Uume_core_Uume_ocm_dmac/Uume_ocd_o2t_rast/Uume_ocd_o2t_rast_ch1_Uume_ocd_rast_ibuf_upr_Ufpb256x128_MEM1/VDDCE }
connect_supply_net VDD1V_MEM -ports { uume/Uume_core_Uume_odm_dmac/Uume_odd_axi1r1/Uaxi_master_r_uif_Uaxi_master_dfifo_r_genblk2_Ufp256x160_MEM0/VDDCE }
connect_supply_net VDD1V_MEM -ports { uume/Uume_core_Uume_odm_dmac/Uume_odd_axi1r1/Uaxi_master_r_uif_Uaxi_master_dfifo_r_genblk2_Ufp256x160_MEM1/VDDCE }
connect_supply_net VDD1V_MEM -ports { uume/Uume_core_Uume_ubus_ctrl/Uume_ubc_ref_mem/Ufp112x140_0_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uume/Uume_core_Uume_ubus_ctrl/Uume_ubc_ref_mem/Ufp112x140_1_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Udpbs128x16_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Ufp512x120_MEM00/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Ufp512x120_MEM01/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Ufp512x120_MEM10/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Ufp512x120_MEM11/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_ahbif_Uusc_auxtbl_Uspbs256x64_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_ahbif_Uusc_bastbl_Udpbs256x32_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_ahbif_Uusc_pictbl_0_Uspbs32x64_ram16_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_ahbif_Uusc_pictbl_0_Uspbs32x64_ram17_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_ahbif_Uusc_pictbl_0_Uspbs32x96_ram15_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_ahbif_Uusc_pictbl_0_Uspbs416x64_ram22_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_ahbif_Uusc_pictbl_0_Uspbs416x64_ram23_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_ahbif_Uusc_pictbl_1_Uspbs32x64_ram16_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_ahbif_Uusc_pictbl_1_Uspbs32x64_ram17_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_ahbif_Uusc_pictbl_1_Uspbs32x96_ram15_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_ahbif_Uusc_pictbl_1_Uspbs416x64_ram22_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_ahbif_Uusc_pictbl_1_Uspbs416x64_ram23_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_bcmmem/Ufp320x128_f1_MEM00/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_bcmmem/Ufp320x128_f1_MEM01/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_bcmmem/Ufp320x128_f1_MEM10/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_bcmmem/Ufp320x128_f1_MEM11/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_bcmmem/Ufp320x128_f2_MEM00/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_bcmmem/Ufp320x128_f2_MEM01/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_bcmmem/Ufp320x128_f2_MEM10/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_bcmmem/Ufp320x128_f2_MEM11/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_cstmem/Ufp128x19_0_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_cstmem/Ufp128x19_1_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_cstmem/Ufp512x20_MEM0/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_cstmem/Ufp512x20_MEM1/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_dbf/Udbfcore/dbf_get_mb_parameter_cb_inst_genblk1_ram_neigh_top_mv_l0_1024x32_MEM0/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_dbf/Udbfcore/dbf_get_mb_parameter_cb_inst_genblk1_ram_neigh_top_mv_l0_1024x32_MEM1/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_dbf/Udbfcore/dbf_get_mb_parameter_cb_inst_genblk1_ram_neigh_top_mv_l0_1024x32_MEM2/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_dbf/Udbfcore/dbf_get_mb_parameter_cb_inst_genblk1_ram_neigh_top_mv_l0_1024x32_MEM3/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_dbf/Udbfcore/dbf_get_mb_parameter_cb_inst_genblk1_ram_neigh_top_mv_l1_1024x32_MEM0/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_dbf/Udbfcore/dbf_get_mb_parameter_cb_inst_genblk1_ram_neigh_top_mv_l1_1024x32_MEM1/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_dbf/Udbfcore/dbf_get_mb_parameter_cb_inst_genblk1_ram_neigh_top_mv_l1_1024x32_MEM2/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_dbf/Udbfcore/dbf_get_mb_parameter_cb_inst_genblk1_ram_neigh_top_mv_l1_1024x32_MEM3/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_dbf/Udbfcore/dbf_get_mb_parameter_cb_inst_genblk2_ram_neigh_top_refp_l0_512x9_MEM0/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_dbf/Udbfcore/dbf_get_mb_parameter_cb_inst_genblk2_ram_neigh_top_refp_l0_512x9_MEM1/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_dbf/Udbfcore/dbf_get_mb_parameter_cb_inst_genblk2_ram_neigh_top_refp_l1_512x9_MEM0/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_dbf/Udbfcore/dbf_get_mb_parameter_cb_inst_genblk2_ram_neigh_top_refp_l1_512x9_MEM1/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_dbf/Udbfcore/dbf_get_mb_parameter_cr_inst_genblk1_ram_neigh_top_mv_l0_1024x32_MEM0/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_dbf/Udbfcore/dbf_get_mb_parameter_cr_inst_genblk1_ram_neigh_top_mv_l0_1024x32_MEM1/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_dbf/Udbfcore/dbf_get_mb_parameter_cr_inst_genblk1_ram_neigh_top_mv_l0_1024x32_MEM2/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_dbf/Udbfcore/dbf_get_mb_parameter_cr_inst_genblk1_ram_neigh_top_mv_l0_1024x32_MEM3/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_dbf/Udbfcore/dbf_get_mb_parameter_cr_inst_genblk1_ram_neigh_top_mv_l1_1024x32_MEM0/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_dbf/Udbfcore/dbf_get_mb_parameter_cr_inst_genblk1_ram_neigh_top_mv_l1_1024x32_MEM1/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_dbf/Udbfcore/dbf_get_mb_parameter_cr_inst_genblk1_ram_neigh_top_mv_l1_1024x32_MEM2/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_dbf/Udbfcore/dbf_get_mb_parameter_cr_inst_genblk1_ram_neigh_top_mv_l1_1024x32_MEM3/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_dbf/Udbfcore/dbf_get_mb_parameter_cr_inst_genblk2_ram_neigh_top_refp_l0_512x9_MEM0/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_dbf/Udbfcore/dbf_get_mb_parameter_cr_inst_genblk2_ram_neigh_top_refp_l0_512x9_MEM1/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_dbf/Udbfcore/dbf_get_mb_parameter_cr_inst_genblk2_ram_neigh_top_refp_l1_512x9_MEM0/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_dbf/Udbfcore/dbf_get_mb_parameter_cr_inst_genblk2_ram_neigh_top_refp_l1_512x9_MEM1/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_dbf/Udbfcore/dbf_get_mb_parameter_luma_inst_genblk1_ram_neigh_top_mv_l0_1024x32_MEM0/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_dbf/Udbfcore/dbf_get_mb_parameter_luma_inst_genblk1_ram_neigh_top_mv_l0_1024x32_MEM1/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_dbf/Udbfcore/dbf_get_mb_parameter_luma_inst_genblk1_ram_neigh_top_mv_l0_1024x32_MEM2/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_dbf/Udbfcore/dbf_get_mb_parameter_luma_inst_genblk1_ram_neigh_top_mv_l0_1024x32_MEM3/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_dbf/Udbfcore/dbf_get_mb_parameter_luma_inst_genblk1_ram_neigh_top_mv_l1_1024x32_MEM0/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_dbf/Udbfcore/dbf_get_mb_parameter_luma_inst_genblk1_ram_neigh_top_mv_l1_1024x32_MEM1/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_dbf/Udbfcore/dbf_get_mb_parameter_luma_inst_genblk1_ram_neigh_top_mv_l1_1024x32_MEM2/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_dbf/Udbfcore/dbf_get_mb_parameter_luma_inst_genblk1_ram_neigh_top_mv_l1_1024x32_MEM3/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_dbf/Udbfcore/dbf_get_mb_parameter_luma_inst_genblk2_ram_neigh_top_refp_l0_512x9_MEM0/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_dbf/Udbfcore/dbf_get_mb_parameter_luma_inst_genblk2_ram_neigh_top_refp_l0_512x9_MEM1/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_dbf/Udbfcore/dbf_get_mb_parameter_luma_inst_genblk2_ram_neigh_top_refp_l1_512x9_MEM0/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_dbf/Udbfcore/dbf_get_mb_parameter_luma_inst_genblk2_ram_neigh_top_refp_l1_512x9_MEM1/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_dbf/Udbfcore/fp_curr_luma_128x40_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_dbf/Udbfcore/fp_horz_luma_64x40_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_dbf/Udbfcore/fp_out_lu_128x40_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_dbf/Udbfcore/fp_update_luma_256x40_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_dbf/Udbfcore/genblk1_fp_curr_cb_64x40_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_dbf/Udbfcore/genblk1_fp_curr_cr_64x40_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_dbf/Udbfcore/genblk3_fp_line_cb_2048x40_MEM0/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_dbf/Udbfcore/genblk3_fp_line_cb_2048x40_MEM1/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_dbf/Udbfcore/genblk3_fp_line_cb_2048x40_MEM2/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_dbf/Udbfcore/genblk3_fp_line_cb_2048x40_MEM3/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_dbf/Udbfcore/genblk3_fp_line_cb_2048x40_MEM4/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_dbf/Udbfcore/genblk3_fp_line_cb_2048x40_MEM5/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_dbf/Udbfcore/genblk3_fp_line_cb_2048x40_MEM6/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_dbf/Udbfcore/genblk3_fp_line_cb_2048x40_MEM7/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_dbf/Udbfcore/genblk3_fp_line_cr_2048x40_MEM0/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_dbf/Udbfcore/genblk3_fp_line_cr_2048x40_MEM1/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_dbf/Udbfcore/genblk3_fp_line_cr_2048x40_MEM2/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_dbf/Udbfcore/genblk3_fp_line_cr_2048x40_MEM3/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_dbf/Udbfcore/genblk3_fp_line_cr_2048x40_MEM4/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_dbf/Udbfcore/genblk3_fp_line_cr_2048x40_MEM5/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_dbf/Udbfcore/genblk3_fp_line_cr_2048x40_MEM6/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_dbf/Udbfcore/genblk3_fp_line_cr_2048x40_MEM7/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_dbf/Udbfcore/genblk3_fp_line_lu_4096x40_MEM0/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_dbf/Udbfcore/genblk3_fp_line_lu_4096x40_MEM1/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_dbf/Udbfcore/genblk3_fp_line_lu_4096x40_MEM10/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_dbf/Udbfcore/genblk3_fp_line_lu_4096x40_MEM11/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_dbf/Udbfcore/genblk3_fp_line_lu_4096x40_MEM12/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_dbf/Udbfcore/genblk3_fp_line_lu_4096x40_MEM13/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_dbf/Udbfcore/genblk3_fp_line_lu_4096x40_MEM14/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_dbf/Udbfcore/genblk3_fp_line_lu_4096x40_MEM15/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_dbf/Udbfcore/genblk3_fp_line_lu_4096x40_MEM2/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_dbf/Udbfcore/genblk3_fp_line_lu_4096x40_MEM3/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_dbf/Udbfcore/genblk3_fp_line_lu_4096x40_MEM4/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_dbf/Udbfcore/genblk3_fp_line_lu_4096x40_MEM5/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_dbf/Udbfcore/genblk3_fp_line_lu_4096x40_MEM6/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_dbf/Udbfcore/genblk3_fp_line_lu_4096x40_MEM7/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_dbf/Udbfcore/genblk3_fp_line_lu_4096x40_MEM8/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_dbf/Udbfcore/genblk3_fp_line_lu_4096x40_MEM9/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_dbf/Udbfcore/genblk4_fp_update_cb_128x40_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_dbf/Udbfcore/genblk4_fp_update_cr_128x40_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_dbf/Udbfcore/genblk5_fp_out_cb_64x40_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_dbf/Udbfcore/genblk5_fp_out_cr_64x40_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_dbf/Uusc_dbf_bcmif/Ufp1024x10_y_MEM0/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_dbf/Uusc_dbf_bcmif/Ufp1024x10_y_MEM1/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_dbf/Uusc_dbf_bcmif/Ufp1024x10_y_MEM2/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_dbf/Uusc_dbf_bcmif/Ufp1024x10_y_MEM3/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_dbf/Uusc_dbf_bcmif/Ufp512x10_b_MEM0/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_dbf/Uusc_dbf_bcmif/Ufp512x10_b_MEM1/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_dbf/Uusc_dbf_bcmif/Ufp512x10_r_MEM0/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_dbf/Uusc_dbf_bcmif/Ufp512x10_r_MEM1/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_dbf/Uusc_dbf_refmif/Ufp32x96_tb_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_dbf/Uusc_dbf_refmif/Ufp32x96_tr_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_dbf/Uusc_dbf_refmif/Ufp32x96_ty_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_dbf/Uusc_dbf_refmif/Ufp64x192_pb_MEM0/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_dbf/Uusc_dbf_refmif/Ufp64x192_pb_MEM1/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_dbf/Uusc_dbf_refmif/Ufp64x192_pr_MEM0/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_dbf/Uusc_dbf_refmif/Ufp64x192_pr_MEM1/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_dbf/Uusc_dbf_refmif/Ufp64x192_py_MEM0/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_dbf/Uusc_dbf_refmif/Ufp64x192_py_MEM1/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_ipc/Ufp64x48_c_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_ipc/Ufp64x48_y_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_ipr_p0/genblk1_c_predsample_mem_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_linmem/Usps512x96_p0b_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_linmem/Usps512x96_p0r_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_linmem/Usps512x96_p0y_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_linmem/Usps512x96_p1b_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_linmem/Usps512x96_p1r_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_linmem/Usps512x96_p1y_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_mcc/Ufp128x90_l0_b_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_mcc/Ufp128x90_l0_r_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_mcc/Ufp128x90_l1_b_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_mcc/Ufp128x90_l1_r_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_mcctl/Ufp128x32_colram_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_mcctl/Ufp64x30_tref_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_mcctl/Uusc_mcctl_mvsel/Ufp64x33_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_mcctl/Uusc_mcctl_tmpmem/Ufp240x128_tmp_c0_MEM0/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_mcctl/Uusc_mcctl_tmpmem/Ufp240x128_tmp_c0_MEM1/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_mcctl/Uusc_mcctl_tmpmem/Ufp240x128_tmp_c1_MEM0/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_mcctl/Uusc_mcctl_tmpmem/Ufp240x128_tmp_c1_MEM1/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_mcctl/Uusc_mcctl_tmpmem/Ufp240x128_tmp_c2_MEM0/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_mcctl/Uusc_mcctl_tmpmem/Ufp240x128_tmp_c2_MEM1/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_mcctl/Uusc_mcctl_tmpmem/Ufp432x128_tmp_y0_MEM00/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_mcctl/Uusc_mcctl_tmpmem/Ufp432x128_tmp_y0_MEM01/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_mcctl/Uusc_mcctl_tmpmem/Ufp432x128_tmp_y0_MEM10/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_mcctl/Uusc_mcctl_tmpmem/Ufp432x128_tmp_y0_MEM11/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_mcctl/Uusc_mcctl_tmpmem/Ufp432x128_tmp_y1_MEM00/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_mcctl/Uusc_mcctl_tmpmem/Ufp432x128_tmp_y1_MEM01/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_mcctl/Uusc_mcctl_tmpmem/Ufp432x128_tmp_y1_MEM10/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_mcctl/Uusc_mcctl_tmpmem/Ufp432x128_tmp_y1_MEM11/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_mcctl/Uusc_mcctl_tmpmem/Ufp432x128_tmp_y2_MEM00/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_mcctl/Uusc_mcctl_tmpmem/Ufp432x128_tmp_y2_MEM01/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_mcctl/Uusc_mcctl_tmpmem/Ufp432x128_tmp_y2_MEM10/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_mcctl/Uusc_mcctl_tmpmem/Ufp432x128_tmp_y2_MEM11/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_mcmem/Usps32x80_b0_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_mcmem/Usps32x80_b1_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_mcmem/Usps32x80_b2_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_mcmem/Usps32x80_r0_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_mcmem/Usps32x80_r1_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_mcmem/Usps32x80_r2_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_mcmem/Usps32x80_yb0_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_mcmem/Usps32x80_yb1_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_mcmem/Usps32x80_yb2_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_mcmem/Usps32x80_yb3_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_mcmem/Usps32x80_yb4_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_mcmem/Usps32x80_yd0_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_mcmem/Usps32x80_yd1_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_mcmem/Usps32x80_ye0_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_mcmem/Usps32x80_ye1_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_mcy/Ufp288x90_d0_MEM00/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_mcy/Ufp288x90_d0_MEM01/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_mcy/Ufp288x90_d0_MEM10/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_mcy/Ufp288x90_d0_MEM11/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_mcy/Ufp288x90_d1_MEM00/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_mcy/Ufp288x90_d1_MEM01/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_mcy/Ufp288x90_d1_MEM10/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_mcy/Ufp288x90_d1_MEM11/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_mcy/Ufp288x90_e0_MEM00/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_mcy/Ufp288x90_e0_MEM01/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_mcy/Ufp288x90_e0_MEM10/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_mcy/Ufp288x90_e0_MEM11/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_mcy/Ufp288x90_e1_MEM00/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_mcy/Ufp288x90_e1_MEM01/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_mcy/Ufp288x90_e1_MEM10/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_mcy/Ufp288x90_e1_MEM11/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_mcy/Ufp64x48_d_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_mcy/Ufp64x48_e_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_mdmem/Uspbs64x32_0_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_mdmem/Uspbs64x32_10_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_mdmem/Uspbs64x32_11_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_mdmem/Uspbs64x32_1_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_mdmem/Uspbs64x32_2_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_mdmem/Uspbs64x32_3_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_mdmem/Uspbs64x32_4_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_mdmem/Uspbs64x32_5_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_mdmem/Uspbs64x32_6_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_mdmem/Uspbs64x32_7_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_mdmem/Uspbs64x32_8_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_mdmem/Uspbs64x32_9_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_ocmif/Uusc_axi_mr1_Uaxi_master_r_uif_Uaxi_master_cfifo_genblk2_Ufp128x36_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_ocmif/Uusc_axi_mr1_Uaxi_master_r_uif_Uaxi_master_dfifo_r_genblk2_Ufp512x128_MEM00/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_ocmif/Uusc_axi_mr1_Uaxi_master_r_uif_Uaxi_master_dfifo_r_genblk2_Ufp512x128_MEM01/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_ocmif/Uusc_axi_mr1_Uaxi_master_r_uif_Uaxi_master_dfifo_r_genblk2_Ufp512x128_MEM10/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_ocmif/Uusc_axi_mr1_Uaxi_master_r_uif_Uaxi_master_dfifo_r_genblk2_Ufp512x128_MEM11/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_ocmif/Uusc_axi_mr2_b_Uaxi_master_r_uif0_Uaxi_master_cfifo_genblk2_Ufp128x36_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_ocmif/Uusc_axi_mr2_b_Uaxi_master_r_uif0_Uaxi_master_dfifo_r_genblk2_Ufp512x128_MEM00/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_ocmif/Uusc_axi_mr2_b_Uaxi_master_r_uif0_Uaxi_master_dfifo_r_genblk2_Ufp512x128_MEM01/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_ocmif/Uusc_axi_mr2_b_Uaxi_master_r_uif0_Uaxi_master_dfifo_r_genblk2_Ufp512x128_MEM10/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_ocmif/Uusc_axi_mr2_b_Uaxi_master_r_uif0_Uaxi_master_dfifo_r_genblk2_Ufp512x128_MEM11/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_ocmif/Uusc_axi_mr2_b_Uaxi_master_r_uif1_Uaxi_master_dfifo_r_genblk2_Ufp256x128_MEM0/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_ocmif/Uusc_axi_mr2_b_Uaxi_master_r_uif1_Uaxi_master_dfifo_r_genblk2_Ufp256x128_MEM1/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_ocmif/Uusc_axi_mw5_Uaxi_master_w_uif0_Uaxi_master_dfifo_w_genblk2_Ufp256x128_MEM0/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_ocmif/Uusc_axi_mw5_Uaxi_master_w_uif0_Uaxi_master_dfifo_w_genblk2_Ufp256x128_MEM1/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_ocmif/Uusc_axi_mw5_Uaxi_master_w_uif1_Uaxi_master_dfifo_w_genblk2_Ufp256x128_MEM0/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_ocmif/Uusc_axi_mw5_Uaxi_master_w_uif1_Uaxi_master_dfifo_w_genblk2_Ufp256x128_MEM1/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_ocmif/Uusc_axi_mw5_Uaxi_master_w_uif2_Uaxi_master_dfifo_w_genblk2_Ufp256x128_MEM0/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_ocmif/Uusc_axi_mw5_Uaxi_master_w_uif2_Uaxi_master_dfifo_w_genblk2_Ufp256x128_MEM1/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_ocmif/Uusc_axi_mw5_Uaxi_master_w_uif3_Uaxi_master_dfifo_w_genblk2_Ufp256x128_MEM0/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_ocmif/Uusc_axi_mw5_Uaxi_master_w_uif3_Uaxi_master_dfifo_w_genblk2_Ufp256x128_MEM1/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_ocmif/Uusc_axi_mw5_Uaxi_master_w_uif4_Uaxi_master_dfifo_w_genblk2_Ufp256x128_MEM0/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_ocmif/Uusc_axi_mw5_Uaxi_master_w_uif4_Uaxi_master_dfifo_w_genblk2_Ufp256x128_MEM1/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_odmif/Uusc_axi_mr1_d_Uaxi_master_r_uif_Uaxi_master_dfifo_r_genblk2_Ufp64x160_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_odmif/Uusc_axi_mr1_e_Uaxi_master_r_uif_Uaxi_master_dfifo_r_genblk2_Ufp64x160_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_qmtrxctl/Ufp64x64_0_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_qmtrxctl/Ufp64x64_1_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_rasmem/Ufpb512x128_bh_MEM00/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_rasmem/Ufpb512x128_bh_MEM01/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_rasmem/Ufpb512x128_bh_MEM10/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_rasmem/Ufpb512x128_bh_MEM11/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_rasmem/Ufpb512x128_bl_MEM00/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_rasmem/Ufpb512x128_bl_MEM01/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_rasmem/Ufpb512x128_bl_MEM10/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_rasmem/Ufpb512x128_bl_MEM11/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_rasmem/Ufpb512x128_rh_MEM00/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_rasmem/Ufpb512x128_rh_MEM01/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_rasmem/Ufpb512x128_rh_MEM10/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_rasmem/Ufpb512x128_rh_MEM11/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_rasmem/Ufpb512x128_rl_MEM00/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_rasmem/Ufpb512x128_rl_MEM01/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_rasmem/Ufpb512x128_rl_MEM10/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_rasmem/Ufpb512x128_rl_MEM11/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_rasmem/Ufpb512x128_yh_MEM00/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_rasmem/Ufpb512x128_yh_MEM01/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_rasmem/Ufpb512x128_yh_MEM10/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_rasmem/Ufpb512x128_yh_MEM11/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_rasmem/Ufpb512x128_yl_MEM00/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_rasmem/Ufpb512x128_yl_MEM01/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_rasmem/Ufpb512x128_yl_MEM10/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_rasmem/Ufpb512x128_yl_MEM11/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_rcnmem/Ufpb192x96_cb_MEM0/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_rcnmem/Ufpb192x96_cb_MEM1/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_rcnmem/Ufpb192x96_cr_MEM0/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_rcnmem/Ufpb192x96_cr_MEM1/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_rcnmem/Ufpb192x96_y_MEM0/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_rcnmem/Ufpb192x96_y_MEM1/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_tgtmem/Uspbs32x96_b0_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_tgtmem/Uspbs32x96_b10_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_tgtmem/Uspbs32x96_b11_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_tgtmem/Uspbs32x96_b1_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_tgtmem/Uspbs32x96_b2_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_tgtmem/Uspbs32x96_b3_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_tgtmem/Uspbs32x96_b4_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_tgtmem/Uspbs32x96_b5_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_tgtmem/Uspbs32x96_b6_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_tgtmem/Uspbs32x96_b7_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_tgtmem/Uspbs32x96_b8_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_tgtmem/Uspbs32x96_b9_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_tgtmem/Uspbs32x96_r0_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_tgtmem/Uspbs32x96_r10_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_tgtmem/Uspbs32x96_r11_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_tgtmem/Uspbs32x96_r1_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_tgtmem/Uspbs32x96_r2_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_tgtmem/Uspbs32x96_r3_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_tgtmem/Uspbs32x96_r4_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_tgtmem/Uspbs32x96_r5_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_tgtmem/Uspbs32x96_r6_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_tgtmem/Uspbs32x96_r7_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_tgtmem/Uspbs32x96_r8_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_tgtmem/Uspbs32x96_r9_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_tgtmem/Uspbs32x96_y0_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_tgtmem/Uspbs32x96_y10_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_tgtmem/Uspbs32x96_y11_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_tgtmem/Uspbs32x96_y1_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_tgtmem/Uspbs32x96_y2_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_tgtmem/Uspbs32x96_y3_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_tgtmem/Uspbs32x96_y4_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_tgtmem/Uspbs32x96_y5_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_tgtmem/Uspbs32x96_y6_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_tgtmem/Uspbs32x96_y7_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_tgtmem/Uspbs32x96_y8_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_tgtmem/Uspbs32x96_y9_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_uecif/Udpbs96x192_cb_MEM0/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_uecif/Udpbs96x192_cb_MEM1/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_uecif/Udpbs96x192_cr_MEM0/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_uecif/Udpbs96x192_cr_MEM1/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_uecif/Udpbs96x192_y_MEM0/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_uecif/Udpbs96x192_y_MEM1/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_uecif/Ufpb384x16_MEM0/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_uecif/Ufpb384x16_MEM1/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_uecif/Ufpb64x192_cb_MEM0/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_uecif/Ufpb64x192_cb_MEM1/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_uecif/Ufpb64x192_cr_MEM0/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_uecif/Ufpb64x192_cr_MEM1/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_uecif/Ufpb64x192_y_MEM0/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_uecif/Ufpb64x192_y_MEM1/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_uecif/Ufpb64x96_cb_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_uecif/Ufpb64x96_cr_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_uecif/Ufpb64x96_y_MEM/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_umeif/Ufp224x140_MEM0/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_umeif/Ufp224x140_MEM1/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_umeif/Ufp512x12_cb_MEM0/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_umeif/Ufp512x12_cb_MEM1/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_umeif/Ufp512x12_cr_MEM0/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_umeif/Ufp512x12_cr_MEM1/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_umeif/Ufp512x12_y_MEM0/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_umeif/Ufp512x12_y_MEM1/VDDCE }
connect_supply_net VDD1V_MEM -ports { uusc/Uusc_umeif/Ufpb256x16_MEM/VDDCE }
